sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/*!
    \file    gd32a7xx_timer.h
    \brief   definitions for the TIMER

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_TIMER_H
#define GD32A7XX_TIMER_H

#include "gd32a7xx.h"

/* Advanced TIMERx(x=0,7,19,20,60,61,62,63) definitions */
#define TIMER0                           (TIMER_BASE + 0x00012C00U)                 /*!< TIMER0 base address  */
#define TIMER7                           (TIMER_BASE + 0x00013400U)                 /*!< TIMER7 base address  */
#define TIMER19                          (TIMER_BASE + 0x00015000U)                 /*!< TIMER19 base address */
#define TIMER20                          (TIMER_BASE + 0x00000000U)                 /*!< TIMER20 base address */
#define TIMER60                          (TIMER_BASE + 0x00001000U)                 /*!< TIMER60 base address */
#define TIMER61                          (TIMER_BASE + 0x0000D000U)                 /*!< TIMER61 base address */
#define TIMER62                          (TIMER_BASE + 0x00016400U)                 /*!< TIMER62 base address */
#define TIMER63                          (TIMER_BASE + 0x0000D400U)                 /*!< TIMER63 base address */

/* General TIMERx(x=1, 2) definitions */
#define TIMER1                           (TIMER_BASE + 0x00015C00U)                 /*!< TIMER1 base address  */
#define TIMER2                           (TIMER_BASE + 0x00000400U)                 /*!< TIMER2 base address  */

/* Basic TIMERx(x=5, 6) definitions */
#define TIMER5                           (TIMER_BASE + 0x00016000U)                 /*!< TIMER5 base address */
#define TIMER6                           (TIMER_BASE + 0x00001400U)                 /*!< TIMER6 base address */

/* registers definitions-- shared registers */
#define TIMER_CTL0(timerx)               REG32((timerx) + 0x00000000U)              /*!< TIMER control register 0 */
#define TIMER_CTL1(timerx)               REG32((timerx) + 0x00000004U)              /*!< TIMER control register 1 */
#define TIMER_SMCFG(timerx)              REG32((timerx) + 0x00000008U)              /*!< TIMER slave mode configuration register */
#define TIMER_DMAINTEN0(timerx)          REG32((timerx) + 0x0000000CU)              /*!< TIMER DMA and interrupt enable register0 */
#define TIMER_DMAINTEN1(timerx)          REG32((timerx) + 0x0000008CU)              /*!< TIMER DMA and interrupt enable register1 */
#define TIMER_INTF(timerx)               REG32((timerx) + 0x00000010U)              /*!< TIMER interrupt flag register */
#define TIMER_SWEVG(timerx)              REG32((timerx) + 0x00000014U)              /*!< TIMER software event generation register */
#define TIMER_CHCTL0(timerx)             REG32((timerx) + 0x00000018U)              /*!< TIMER channel control register 0 */
#define TIMER_CHCTL1(timerx)             REG32((timerx) + 0x0000001CU)              /*!< TIMER channel control register 1 */
#define TIMER_CHCTL2(timerx)             REG32((timerx) + 0x00000020U)              /*!< TIMER channel control register 2 */
#define TIMER_CNT(timerx)                REG32((timerx) + 0x00000024U)              /*!< TIMER counter register */
#define TIMER_PSC(timerx)                REG32((timerx) + 0x00000028U)              /*!< TIMER prescaler register */
#define TIMER_CAR(timerx)                REG32((timerx) + 0x0000002CU)              /*!< TIMER counter auto reload register */
#define TIMER_CREP(timerx)               REG32((timerx) + 0x00000030U)              /*!< TIMER counter repetition register */
#define TIMER_CH0CV(timerx)              REG32((timerx) + 0x00000034U)              /*!< TIMER channel 0 capture or compare value register */
#define TIMER_CH1CV(timerx)              REG32((timerx) + 0x00000038U)              /*!< TIMER channel 1 capture or compare value register */
#define TIMER_CH2CV(timerx)              REG32((timerx) + 0x0000003CU)              /*!< TIMER channel 2 capture or compare value register */
#define TIMER_CH3CV(timerx)              REG32((timerx) + 0x00000040U)              /*!< TIMER channel 3 capture or compare value register */
#define TIMER_CCHP(timerx)               REG32((timerx) + 0x00000044U)              /*!< TIMER channel complementary protection register */
#define TIMER_MCHCTL0(timerx)            REG32((timerx) + 0x00000048U)              /*!< TIMER multi mode channel control register 0 */
#define TIMER_MCHCTL1(timerx)            REG32((timerx) + 0x0000004CU)              /*!< TIMER multi mode channel control register 1 */
#define TIMER_MCHCTL2(timerx)            REG32((timerx) + 0x00000050U)              /*!< TIMER multi mode channel control register 2 */
#define TIMER_MCH0CV(timerx)             REG32((timerx) + 0x00000054U)              /*!< TIMER multi mode channel 0 capture or compare value register */
#define TIMER_MCH1CV(timerx)             REG32((timerx) + 0x00000058U)              /*!< TIMER multi mode channel 1 capture or compare value register */
#define TIMER_MCH2CV(timerx)             REG32((timerx) + 0x0000005CU)              /*!< TIMER multi mode channel 2 capture or compare value register */
#define TIMER_MCH3CV(timerx)             REG32((timerx) + 0x00000060U)              /*!< TIMER multi mode channel 3 capture or compare value register */
#define TIMER_CH0CV_ADD(timerx)          REG32((timerx) + 0x00000064U)              /*!< TIMER channel 0 additional compare value register */
#define TIMER_CH1CV_ADD(timerx)          REG32((timerx) + 0x00000068U)              /*!< TIMER channel 1 additional compare value register */
#define TIMER_CH2CV_ADD(timerx)          REG32((timerx) + 0x0000006CU)              /*!< TIMER channel 2 additional compare value register */
#define TIMER_CH3CV_ADD(timerx)          REG32((timerx) + 0x00000070U)              /*!< TIMER channel 3 additional compare value register */
#define TIMER_CTL2(timerx)               REG32((timerx) + 0x00000074U)              /*!< TIMER control register 2 */
#define TIMER_BRKCFG(timerx)             REG32((timerx) + 0x00000078U)              /*!< TIMER break configuration register */
#define TIMER_FCCHP0(timerx)             REG32((timerx) + 0x0000007CU)              /*!< TIMER free complementary channel protection register 0 */
#define TIMER_FCCHP1(timerx)             REG32((timerx) + 0x00000080U)              /*!< TIMER free complementary channel protection register 1 */
#define TIMER_FCCHP2(timerx)             REG32((timerx) + 0x00000084U)              /*!< TIMER free complementary channel protection register 2 */
#define TIMER_FCCHP3(timerx)             REG32((timerx) + 0x00000088U)              /*!< TIMER free complementary channel protection register 3 */
#define TIMER_MCH0CV_ADD(timerx)         REG32((timerx) + 0x00000090U)              /*!< TIMER Multi mode channel 0 additional capture/compre value register */
#define TIMER_MCH1CV_ADD(timerx)         REG32((timerx) + 0x00000094U)              /*!< TIMER Multi mode channel 1 additional capture/compre value register */
#define TIMER_MCH2CV_ADD(timerx)         REG32((timerx) + 0x00000098U)              /*!< TIMER Multi mode channel 2 additional capture/compre value register */
#define TIMER_MCH3CV_ADD(timerx)         REG32((timerx) + 0x0000009CU)              /*!< TIMER Multi mode channel 3 additional capture/compre value register */
#define TIMER_WDGPER(timerx)             REG32((timerx) + 0x000000A0U)              /*!< TIMER Watch Dog Period Register */
#define TIMER_CINITCTL(timerx)           REG32((timerx) + 0x000000A4U)              /*!< TIMER Counter Initial control register */
#define TIMER_CINITV(timerx)             REG32((timerx) + 0x000000A8U)              /*!< TIMER Counter Initial Value register */
#define TIMER_CHMECAPCFG(timerx)         REG32((timerx) + 0x000000ACU)              /*!< TIMER channel multi edge capture configuration register. */
#define TIMER_MCHMECAPCFG(timerx)        REG32((timerx) + 0x000000B0U)              /*!< TIMER Multi-Mode channel multi edge capture configuration register. */
#define TIMER_CH0MECAP(timerx)           REG32((timerx) + 0x000000B4U)              /*!< TIMER Channel 0 multi-edge capture register */
#define TIMER_CH1MECAP(timerx)           REG32((timerx) + 0x000000B8U)              /*!< TIMER Channel 1 multi-edge capture register */
#define TIMER_CH2MECAP(timerx)           REG32((timerx) + 0x000000BCU)              /*!< TIMER Channel 2 multi-edge capture register */
#define TIMER_CH3MECAP(timerx)           REG32((timerx) + 0x000000C0U)              /*!< TIMER Channel 3 multi-edge capture register */
#define TIMER_MCH0MECAP(timerx)          REG32((timerx) + 0x000000C4U)              /*!< TIMER Channel 0 multi-edge capture register */
#define TIMER_MCH1MECAP(timerx)          REG32((timerx) + 0x000000C8U)              /*!< TIMER Channel 1 multi-edge capture register */
#define TIMER_MCH2MECAP(timerx)          REG32((timerx) + 0x000000CCU)              /*!< TIMER Channel 2 multi-edge capture register */
#define TIMER_MCH3MECAP(timerx)          REG32((timerx) + 0x000000D0U)              /*!< TIMER Channel 3 multi-edge capture register */
#define TIMER_DMACFG(timerx)             REG32((timerx) + 0x000000E0U)              /*!< TIMER DMA configuration register */
#define TIMER_DMATB(timerx)              REG32((timerx) + 0x000000E4U)              /*!< TIMER DMA transfer buffer register */
#define TIMER_CFG(timerx)                REG32((timerx) + 0x000000FCU)              /*!< TIMER configuration register */

