sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* registers definitions-- general level 0 timer only */
#define TIMER_IRMP(timerx)               REG32((timerx) + 0x00000050U)              /*!< TIMER channel input remap register (only for TIMER1, TIMER2) */

/* registers definitions-- basic timer only */
#define TIMER_DMAINTEN(timerx)           REG32((timerx) + 0x0000000CU)                /*!< TIMER DMA/interrupt Enable Register0 */
#define TIMER_CNT0(timerx)               REG32((timerx) + 0x00000018U)                /*!< TIMER counter register 0 */
#define TIMER_CNT1(timerx)               REG32((timerx) + 0x0000001CU)                /*!< TIMER counter register 1*/
#define TIMER_CNT2(timerx)               REG32((timerx) + 0x00000020U)                /*!< TIMER counter register 2*/
#define TIMER_CNT3(timerx)               REG32((timerx) + 0x00000024U)                /*!< TIMER counter register 3*/
#define TIMER_PSC0(timerx)               REG32((timerx) + 0x00000028U)                /*!< TIMER prescaler register 0 */
#define TIMER_PSC1(timerx)               REG32((timerx) + 0x0000002CU)                /*!< TIMER prescaler register 1 */
#define TIMER_PSC2(timerx)               REG32((timerx) + 0x00000030U)                /*!< TIMER prescaler register 2 */
#define TIMER_PSC3(timerx)               REG32((timerx) + 0x00000034U)                /*!< TIMER prescaler register 3 */
#define TIMER_CAR0(timerx)               REG32((timerx) + 0x00000038U)                /*!< TIMER counter auto reload register 0 */
#define TIMER_CAR1(timerx)               REG32((timerx) + 0x0000003CU)                /*!< TIMER counter auto reload register 1 */
#define TIMER_CAR2(timerx)               REG32((timerx) + 0x00000040U)                /*!< TIMER counter auto reload register 2 */
#define TIMER_CAR3(timerx)               REG32((timerx) + 0x00000044U)                /*!< TIMER counter auto reload register 3 */
#define TIMER_CASCH(timerx)              REG32((timerx) + 0x00000048U)                /*!< TIMER cascade timer high register */
#define TIMER_CASCL(timerx)              REG32((timerx) + 0x0000004CU)                /*!< TIMER cascade timer lowregister */
#define TIMER_BASIC_CNT(timerx, ch)      REG32((timerx) + 0x00000018U + 0x04U * (ch)) /*!< TIMER basic counter register of channel x */
#define TIMER_BASIC_PSC(timerx, ch)      REG32((timerx) + 0x00000028U + 0x04U * (ch)) /*!< TIMER basic counter register of channel x */
#define TIMER_BASIC_CAR(timerx, ch)      REG32((timerx) + 0x00000038U + 0x04U * (ch)) /*!< TIMER basic counter register of channel x */

/* bits definitions */
/* TIMER_CTL0 */
#define TIMER_CTL0_CEN                   BIT(0)                                     /*!< TIMER counter enable */
#define TIMER_CTL0_UPDIS                 BIT(1)                                     /*!< update disable */
#define TIMER_CTL0_UPS                   BIT(2)                                     /*!< update source */
#define TIMER_CTL0_SPM                   BIT(3)                                     /*!< single pulse mode */
#define TIMER_CTL0_DIR                   BIT(4)                                     /*!< timer counter direction */
#define TIMER_CTL0_CAM                   BITS(5,6)                                  /*!< counter aligned mode selection */
#define TIMER_CTL0_ARSE                  BIT(7)                                     /*!< auto-reload shadow enable */
#define TIMER_CTL0_CKDIV                 BITS(8,9)                                  /*!< clock division */
#define TIMER_CTL0_CFBEN                 BIT(10)                                    /*!< Couter freeze in break mode enable */
/* bits definitions-- basic timer only */
#define TIMER_CTL0_CEN0                  BIT(0)                                     /*!< TIMER counter enable of channel 0 */
#define TIMER_CTL0_CEN1                  BIT(1)                                     /*!< TIMER counter enable of channel 1 */
#define TIMER_CTL0_CEN2                  BIT(2)                                     /*!< TIMER counter enable of channel 2 */
#define TIMER_CTL0_CEN3                  BIT(3)                                     /*!< TIMER counter enable of channel 3 */
#define TIMER_CTL0_UPDIS0                BIT(4)                                     /*!< update disable of channel 0 */
#define TIMER_CTL0_UPDIS1                BIT(5)                                     /*!< update disable of channel 1 */
#define TIMER_CTL0_UPDIS2                BIT(6)                                     /*!< update disable of channel 2 */
#define TIMER_CTL0_UPDIS3                BIT(7)                                     /*!< update disable of channel 3 */
#define TIMER_CTL0_UPS0                  BIT(8)                                     /*!< update source of channel 0 */
#define TIMER_CTL0_UPS1                  BIT(9)                                     /*!< update source of channel 1 */
#define TIMER_CTL0_UPS2                  BIT(10)                                    /*!< update source of channel 2 */
#define TIMER_CTL0_UPS3                  BIT(11)                                    /*!< update source of channel 3 */
#define TIMER_CTL0_SPM0                  BIT(12)                                    /*!< single pulse mode of channel 0 */
#define TIMER_CTL0_SPM1                  BIT(13)                                    /*!< single pulse mode of channel 1 */
#define TIMER_CTL0_SPM2                  BIT(14)                                    /*!< single pulse mode of channel 2 */
#define TIMER_CTL0_SPM3                  BIT(15)                                    /*!< single pulse mode of channel 3 */
#define TIMER_CTL0_ARSE0                 BIT(16)                                    /*!< auto-reload shadow enable of channel 0 */
#define TIMER_CTL0_ARSE1                 BIT(17)                                    /*!< auto-reload shadow enable of channel 1 */
#define TIMER_CTL0_ARSE2                 BIT(18)                                    /*!< auto-reload shadow enable of channel 2 */
#define TIMER_CTL0_ARSE3                 BIT(19)                                    /*!< auto-reload shadow enable of channel 3 */

/* TIMER_CTL1 */
#define TIMER_CTL1_CCSE                  BIT(0)                                     /*!< commutation control shadow enable */
#define TIMER_CTL1_CCUC                  (BIT(2) | BITS(30,31))                     /*!< commutation control shadow register update control */
#define TIMER_CTL1_DMAS                  BIT(3)                                     /*!< DMA request source selection */
#define TIMER_CTL1_MMC                   (BIT(25) | BITS(4,6))                      /*!< master mode control */
#define TIMER_CTL1_TI0S                  BIT(7)                                     /*!< channel 0 trigger input selection(hall mode selection) */
#define TIMER_CTL1_ISO0                  BIT(8)                                     /*!< idle state of channel 0 output */
#define TIMER_CTL1_ISO0N                 BIT(9)                                     /*!< idle state of channel 0 complementary output */
#define TIMER_CTL1_ISO1                  BIT(10)                                    /*!< idle state of channel 1 output */
#define TIMER_CTL1_ISO1N                 BIT(11)                                    /*!< idle state of channel 1 complementary output */
#define TIMER_CTL1_ISO2                  BIT(12)                                    /*!< idle state of channel 2 output */
#define TIMER_CTL1_ISO2N                 BIT(13)                                    /*!< idle state of channel 2 complementary output */
#define TIMER_CTL1_ISO3                  BIT(14)                                    /*!< idle state of channel 3 output */
#define TIMER_CTL1_ISO3N                 BIT(15)                                    /*!< idle state of channel 3 complementary output */

/* bits definitions-- basic timer only */
#define TIMER_CTL1_MMC0                  BITS(0,2)                                  /*!< master mode control of channel 0 */
#define TIMER_CTL1_MMC1                  BITS(4,6)                                  /*!< master mode control of channel 1 */
#define TIMER_CTL1_CASC1                 BIT(7)                                     /*!< cascade mode of channel 1 enable */
#define TIMER_CTL1_MMC2                  BITS(8,10)                                 /*!< master mode control of channel 2 */
#define TIMER_CTL1_CASC2                 BIT(11)                                    /*!< cascade mode of channel 2 enable */
#define TIMER_CTL1_MMC3                  BITS(12,14)                                /*!< master mode control of channel 3 */
#define TIMER_CTL1_CASC3                 BIT(15)                                    /*!< cascade mode of channel 3 enable */

/* TIMER_SMCFG */
#define TIMER_SMCFG_MSM                  BIT(7)                                     /*!< master-slave mode */
#define TIMER_SMCFG_ETFC                 BITS(8,11)                                 /*!< external trigger filter control */
#define TIMER_SMCFG_ETPSC                BITS(12,13)                                /*!< external trigger prescaler */
#define TIMER_SMCFG_SMC1                 BIT(14)                                    /*!< part of SMC for enable external clock mode 1 */
#define TIMER_SMCFG_ETP                  BIT(15)                                    /*!< external trigger polarity */
#define TIMER_SMCFG_ETISEL               BITS(28,29)                                /*!< TIMER0 external trigger select */

/* TIMER_DMAINTEN0 */
#define TIMER_DMAINTEN0_UPIE             BIT(0)                                     /*!< update interrupt enable */
#define TIMER_DMAINTEN0_CH0IE            BIT(1)                                     /*!< channel 0 capture or compare interrupt enable */
#define TIMER_DMAINTEN0_CH1IE            BIT(2)                                     /*!< channel 1 capture or compare interrupt enable */
#define TIMER_DMAINTEN0_CH2IE            BIT(3)                                     /*!< channel 2 capture or compare interrupt enable */
#define TIMER_DMAINTEN0_CH3IE            BIT(4)                                     /*!< channel 3 capture or compare interrupt enable */
#define TIMER_DMAINTEN0_CMTIE            BIT(5)                                     /*!< commutation interrupt request enable */
#define TIMER_DMAINTEN0_TRGIE            BIT(6)                                     /*!< trigger interrupt enable */
#define TIMER_DMAINTEN0_BRKIE            BIT(7)                                     /*!< break interrupt enable */
#define TIMER_DMAINTEN0_UPDEN            BIT(8)                                     /*!< update DMA request enable */
#define TIMER_DMAINTEN0_CH0DEN           BIT(9)                                     /*!< channel 0 capture or compare DMA request enable */
#define TIMER_DMAINTEN0_CH1DEN           BIT(10)                                    /*!< channel 1 capture or compare DMA request enable */
#define TIMER_DMAINTEN0_CH2DEN           BIT(11)                                    /*!< channel 2 capture or compare DMA request enable */
#define TIMER_DMAINTEN0_CH3DEN           BIT(12)                                    /*!< channel 3 capture or compare DMA request enable */
#define TIMER_DMAINTEN0_CMTDEN           BIT(13)                                    /*!< commutation DMA request enable */
#define TIMER_DMAINTEN0_TRGDEN           BIT(14)                                    /*!< trigger DMA request enable */
#define TIMER_DMAINTEN0_DECJIE           BIT(16)                                    /*!< Quadrature decoder signal jump (the two signals jump at the same time) interrupt  enable */
#define TIMER_DMAINTEN0_DECDISIE         BIT(17)                                    /*!< Quadrature decoder signal disconnection interrupt enable */
#define TIMER_DMAINTEN0_MCH0IE           BIT(20)                                    /*!< multi mode channel 0 capture or compare interrupt enable */
#define TIMER_DMAINTEN0_MCH1IE           BIT(21)                                    /*!< multi mode channel 1 capture or compare interrupt enable */
#define TIMER_DMAINTEN0_MCH2IE           BIT(22)                                    /*!< multi mode channel 2 capture or compare interrupt enable */
#define TIMER_DMAINTEN0_MCH3IE           BIT(23)                                    /*!< multi mode channel 3 capture or compare interrupt enable */
#define TIMER_DMAINTEN0_MCH0DEN          BIT(24)                                    /*!< multi mode channel 0 capture or compare DMA request enable */
#define TIMER_DMAINTEN0_MCH1DEN          BIT(25)                                    /*!< multi mode channel 1 capture or compare DMA request enable */
#define TIMER_DMAINTEN0_MCH2DEN          BIT(26)                                    /*!< multi mode channel 2 capture or compare DMA request enable */
#define TIMER_DMAINTEN0_MCH3DEN          BIT(27)                                    /*!< multi mode channel 3 capture or compare DMA request enable */
#define TIMER_DMAINTEN0_CH0COMADDIE      BIT(28)                                    /*!< channel 0 additional compare interrupt enable */
#define TIMER_DMAINTEN0_CH1COMADDIE      BIT(29)                                    /*!< channel 1 additional compare interrupt enable */
#define TIMER_DMAINTEN0_CH2COMADDIE      BIT(30)                                    /*!< channel 2 additional compare interrupt enable */
#define TIMER_DMAINTEN0_CH3COMADDIE      BIT(31)                                    /*!< channel 3 additional compare interrupt enable */

/* TIMER_DMAINTEN */
#define TIMER_DMAINTEN_UPIE0              BIT(0)                                     /*!< update interrupt enable of channel 0 */
#define TIMER_DMAINTEN_UPIE1              BIT(1)                                     /*!< update interrupt enable of channel 1 */
#define TIMER_DMAINTEN_UPIE2              BIT(2)                                     /*!< update interrupt enable of channel 2 */
#define TIMER_DMAINTEN_UPIE3              BIT(3)                                     /*!< update interrupt enable of channel 3 */
#define TIMER_DMAINTEN_UPDEN0             BIT(8)                                     /*!< update DMA request enable of channel 0 */
#define TIMER_DMAINTEN_UPDEN1             BIT(9)                                     /*!< update DMA request enable of channel 1 */
#define TIMER_DMAINTEN_UPDEN2             BIT(10)                                    /*!< update DMA request enable of channel 2 */
#define TIMER_DMAINTEN_UPDEN3             BIT(11)                                    /*!< update DMA request enable of channel 3 */

/* TIMER_DMAINTEN1 */
#define TIMER_DMAINTEN1_MCH0COMADDIE     BIT(0)                                     /*!< Multi mode Channel 0 additional compare interrupt enable */
#define TIMER_DMAINTEN1_MCH1COMADDIE     BIT(1)                                     /*!< Multi mode Channel 1 additional compare interrupt enable */
#define TIMER_DMAINTEN1_MCH2COMADDIE     BIT(2)                                     /*!< Multi mode Channel 2 additional compare interrupt enable */
#define TIMER_DMAINTEN1_MCH3COMADDIE     BIT(3)                                     /*!< Multi mode Channel 3 additional compare interrupt enable */

/* TIMER_INTF */
#define TIMER_INTF_UPIF                  BIT(0)                                     /*!< update interrupt flag */
#define TIMER_INTF_CH0IF                 BIT(1)                                     /*!< channel 0 capture or compare interrupt flag */
#define TIMER_INTF_CH1IF                 BIT(2)                                     /*!< channel 1 capture or compare interrupt flag */
#define TIMER_INTF_CH2IF                 BIT(3)                                     /*!< channel 2 capture or compare interrupt flag */
#define TIMER_INTF_CH3IF                 BIT(4)                                     /*!< channel 3 capture or compare interrupt flag */
#define TIMER_INTF_CMTIF                 BIT(5)                                     /*!< channel commutation interrupt flag */
#define TIMER_INTF_TRGIF                 BIT(6)                                     /*!< trigger interrupt flag */
#define TIMER_INTF_BRKIF                 BIT(7)                                     /*!< break interrupt flag */
#define TIMER_INTF_CH0OF                 BIT(9)                                     /*!< channel 0 over capture flag */
#define TIMER_INTF_CH1OF                 BIT(10)                                    /*!< channel 1 over capture flag */
#define TIMER_INTF_CH2OF                 BIT(11)                                    /*!< channel 2 over capture flag */
#define TIMER_INTF_CH3OF                 BIT(12)                                    /*!< channel 3 over capture flag */
#define TIMER_INTF_SYSBIF                BIT(13)                                    /*!< System source break interrupt flag */
#define TIMER_INTF_MCH0COMADDIF          BIT(14)                                    /*!< Multi mode channel 0 additional compare interrupt flag */
#define TIMER_INTF_MCH1COMADDIF          BIT(15)                                    /*!< Multi mode channel 1 additional compare interrupt flag */
#define TIMER_INTF_DECJIF                BIT(16)                                    /*!< Quadrature decoder signal jump (the two signals jump at the same time) interrupt FLAG */
#define TIMER_INTF_DECDISIF              BIT(17)                                    /*!< Quadrature decoder signal disconnection interrupt flag */
#define TIMER_INTF_MCH2COMADDIF          BIT(18)                                    /*!< Multi mode channel 2 additional compare interrupt flag */
#define TIMER_INTF_MCH3COMADDIF          BIT(19)                                    /*!< Multi mode channel 3 additional compare interrupt flag */
#define TIMER_INTF_MCH0IF                BIT(20)                                    /*!< multi mode channel 0 capture or compare interrupt flag */
#define TIMER_INTF_MCH1IF                BIT(21)                                    /*!< multi mode channel 1 capture or compare interrupt flag */
#define TIMER_INTF_MCH2IF                BIT(22)                                    /*!< multi mode channel 2 capture or compare interrupt flag */
#define TIMER_INTF_MCH3IF                BIT(23)                                    /*!< multi mode channel 3 capture or compare interrupt flag */
#define TIMER_INTF_MCH0OF                BIT(24)                                    /*!< multi mode channel 0 over capture flag */
#define TIMER_INTF_MCH1OF                BIT(25)                                    /*!< multi mode channel 1 over capture flag */
#define TIMER_INTF_MCH2OF                BIT(26)                                    /*!< multi mode channel 2 over capture flag */
#define TIMER_INTF_MCH3OF                BIT(27)                                    /*!< multi mode channel 3 over capture flag */
#define TIMER_INTF_CH0COMADDIF           BIT(28)                                    /*!< channel 0 additional compare interrupt flag */
#define TIMER_INTF_CH1COMADDIF           BIT(29)                                    /*!< channel 1 additional compare interrupt flag */
#define TIMER_INTF_CH2COMADDIF           BIT(30)                                    /*!< channel 2 additional compare interrupt flag */
#define TIMER_INTF_CH3COMADDIF           BIT(31)                                    /*!< channel 3 additional compare interrupt flag */
/* bits definitions-- basic timer only */
#define TIMER_INTF_UPIF0                 BIT(0)                                     /*!< update interrupt flag of channel 0 */
#define TIMER_INTF_UPIF1                 BIT(1)                                     /*!< update interrupt flag of channel 1 */
#define TIMER_INTF_UPIF2                 BIT(2)                                     /*!< update interrupt flag of channel 2 */
#define TIMER_INTF_UPIF3                 BIT(3)                                     /*!< update interrupt flag of channel 3 */

