sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
#define TIMER_CHCTL2_MCH0PERFOREN        BIT(24)                                    /*!< multi mode channel 0 period point match moment output control enable */
#define TIMER_CHCTL2_MCH1PERFOREN        BIT(25)                                    /*!< multi mode channel 1 period point match moment output control enable */
#define TIMER_CHCTL2_MCH2PERFOREN        BIT(26)                                    /*!< multi mode channel 2 period point match moment output control enable */
#define TIMER_CHCTL2_MCH3PERFOREN        BIT(27)                                    /*!< multi mode channel 3 period point match moment output control enable */
#define TIMER_CHCTL2_CH0PERFOREN         BIT(28)                                    /*!< channel 0 period point match moment output control enable */
#define TIMER_CHCTL2_CH1PERFOREN         BIT(29)                                    /*!< channel 1 period point match moment output control enable */
#define TIMER_CHCTL2_CH2PERFOREN         BIT(30)                                    /*!< channel 2 period point match moment output control enable */
#define TIMER_CHCTL2_CH3PERFOREN         BIT(31)                                    /*!< channel 3 period point match moment output control enable */


/* TIMER_CNT */
#define TIMER_CNT_CNT                    BITS(0,15)                                 /*!< 16 bit timer counter */
/* bits definitions-- basic timer only */
#define TIMER_CNT0_CNT0                  BITS(0,31)                                 /*!< 16 bit timer counter of channel 0 */
#define TIMER_CNT1_CNT1                  BITS(0,31)                                 /*!< 16 bit timer counter of channel 1 */
#define TIMER_CNT2_CNT2                  BITS(0,31)                                 /*!< 16 bit timer counter of channel 2 */
#define TIMER_CNT3_CNT3                  BITS(0,31)                                 /*!< 16 bit timer counter of channel 3 */

/* TIMER_PSC */
#define TIMER_PSC_PSC                    BITS(0,15)                                 /*!< prescaler value of the counter clock */
/* bits definitions-- basic timer only */
#define TIMER_PSC0_PSC0                  BITS(0,15)                                 /*!< prescaler value of the counter clock of channel 0 */
#define TIMER_PSC1_PSC1                  BITS(0,15)                                 /*!< prescaler value of the counter clock of channel 1 */
#define TIMER_PSC2_PSC2                  BITS(0,15)                                 /*!< prescaler value of the counter clock of channel 2 */
#define TIMER_PSC3_PSC3                  BITS(0,15)                                 /*!< prescaler value of the counter clock of channel 3 */

/* TIMER_CAR */
#define TIMER_CAR_CARL                   BITS(0,15)                                 /*!< 16 bit counter auto reload value */
/* bits definitions-- basic timer only */
#define TIMER_CAR0_CARL0                 BITS(0,31)                                 /*!< 16 bit counter auto reload value of channel 0 */
#define TIMER_CAR1_CARL1                 BITS(0,31)                                 /*!< 16 bit counter auto reload value of channel 1 */
#define TIMER_CAR2_CARL2                 BITS(0,31)                                 /*!< 16 bit counter auto reload value of channel 2 */
#define TIMER_CAR3_CARL3                 BITS(0,31)                                 /*!< 16 bit counter auto reload value of channel 3 */

/* TIMER_CREP */
#define TIMER_CREP_CREP                  BITS(0,7)                                  /*!< counter repetition value */

/* TIMER_CH0CV */
#define TIMER_CH0CV_CH0VAL               BITS(0,15)                                 /*!< 16 bit capture or compare value of channel 0 */

/* TIMER_CH1CV */
#define TIMER_CH1CV_CH1VAL               BITS(0,15)                                 /*!< 16 bit capture or compare value of channel 1 */

/* TIMER_CH2CV */
#define TIMER_CH2CV_CH2VAL               BITS(0,15)                                 /*!< 16 bit capture or compare value of channel 2 */

/* TIMER_CH3CV */
#define TIMER_CH3CV_CH3VAL               BITS(0,15)                                 /*!< 16 bit capture or compare value of channel 3 */

/* TIMER_CCHP */
#define TIMER_CCHP_DTCFG                 BITS(0,7)                                  /*!< dead time configure */
#define TIMER_CCHP_PROT                  BITS(8,9)                                  /*!< complementary register protect control */
#define TIMER_CCHP_IOS                   BIT(10)                                    /*!< idle mode off-state configure */
#define TIMER_CCHP_ROS                   BIT(11)                                    /*!< run mode off-state configure */
#define TIMER_CCHP_BRKEN                 BIT(12)                                    /*!< break enable */
#define TIMER_CCHP_BRKP                  BIT(13)                                    /*!< break polarity */
#define TIMER_CCHP_OAEN                  BIT(14)                                    /*!< output automatic enable */
#define TIMER_CCHP_POEN                  BIT(15)                                    /*!< primary output enable */
#define TIMER_CCHP_DTSEN                 BIT(16)                                    /*!< Deadtime shadow is enabled */

/* TIMER_MCHCTL0 */
/* output compare mode */
#define TIMER_MCHCTL0_MCH0MS             (BITS(0,1) | BIT(30))                      /*!< multi mode channel 0 I/O mode selection */
#define TIMER_MCHCTL0_MCH0COMFEN         BIT(2)                                     /*!< Multi mode Channel 0 output compare fast enable */
#define TIMER_MCHCTL0_MCH0COMSEN         BIT(3)                                     /*!< multi mode channel 0 output compare shadow enable */
#define TIMER_MCHCTL0_MCH0COMCTL         (BITS(4,6) | BIT(16))                      /*!< multi mode channel 0 compare output control */
#define TIMER_MCHCTL0_MCH0COMCEN         BIT(7)                                     /*!< multi mode channel 0 output compare clear enable */
#define TIMER_MCHCTL0_MCH1MS             (BITS(8,9) | BIT(31))                      /*!< multi mode channel 1 I/O mode selection */
#define TIMER_MCHCTL0_MCH1COMFEN         BIT(10)                                    /*!< Multi mode channel 1 output compare fast enable */
#define TIMER_MCHCTL0_MCH1COMSEN         BIT(11)                                    /*!< multi mode channel 1 output compare shadow enable */
#define TIMER_MCHCTL0_MCH1COMCTL         (BITS(12,14) | BIT(24))                    /*!< multi mode channel 1 compare output control */
#define TIMER_MCHCTL0_MCH1COMCEN         BIT(15)                                    /*!< multi mode channel 1 output compare clear enable */
#define TIMER_MCHCTL0_MCH0ADDUPS         BIT(26)                                    /*!< Update selection of multi mode channel 0 additional compare value */
#define TIMER_MCHCTL0_MCH1ADDUPS         BIT(27)                                    /*!< Update selection of multi mode channel 1 additional compare value */
#define TIMER_MCHCTL0_MCH0COMADDSEN      BIT(28)                                    /*!< Multi mode channel 0 output additional compare shadow enable */
#define TIMER_MCHCTL0_MCH1COMADDSEN      BIT(29)                                    /*!< Multi mode channel 1 output additional compare shadow enable */

