sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* TIMER_FCCHP2 */
#define TIMER_FCCHP2_DTCFG               BITS(0,7)                                  /*!< dead time configure */
#define TIMER_FCCHP2_IOS                 BIT(10)                                    /*!< idle mode off-state configure */
#define TIMER_FCCHP2_ROS                 BIT(11)                                    /*!< run mode off-state configure */
#define TIMER_FCCHP2_DT2SEN              BIT(12)                                    /*!< Channel 2 deadtime shadow is enabled. */
#define TIMER_FCCHP2_FCCHP2EN            BIT(31)                                    /*!< free complementary channel protection register 2 enable */

/* TIMER_FCCHP3 */
#define TIMER_FCCHP3_DTCFG               BITS(0,7)                                  /*!< dead time configure */
#define TIMER_FCCHP3_IOS                 BIT(10)                                    /*!< idle mode off-state configure */
#define TIMER_FCCHP3_ROS                 BIT(11)                                    /*!< run mode off-state configure */
#define TIMER_FCCHP3_DT3SEN              BIT(12)                                    /*!< Channel 0 deadtime shadow is enabled. */
#define TIMER_FCCHP3_FCCHP3EN            BIT(31)                                    /*!< free complementary channel protection register 3 enable */

/* TIMERx_MCH0CV_ADD */
#define TIMER_MCH0CV_ADD_MCH0CVAL_ADD   BITS(0, 15)                                /*!< Additional capture/compare value of multi mode channel 0 */

/* TIMERx_MCH1CV_ADD */
#define TIMER_MCH1CV_ADD_MCH1CVAL_ADD   BITS(0, 15)                                /*!< Additional capture/compare value of multi mode channel 1 */

/* TIMERx_MCH2CV_ADD */
#define TIMER_MCH2CV_ADD_MCH2CVAL_ADD   BITS(0, 15)                                /*!< Additional capture/compare value of multi mode channel 2 */

/* TIMERx_MCH3CV_ADD */
#define TIMER_MCH3CV_ADD_MCH3CVAL_ADD   BITS(0, 15)                                /*!< Additional capture/compare value of multi mode channel 3 */

/* TIMERx_WDGPER */
#define TIMER_WDGPER_WDGPER             BITS(0, 31)                                /*!< Watchdog counter period value */

/* TIMERx_CINITCTL */
#define TIMER_CINITCTL_CINITVEN         BIT(0)                                     /*!< Counter initial value register enable */
#define TIMER_CINITCTL_CINITDIR         BIT(1)                                     /*!< Counter initial count direction */
#define TIMER_CINITCTL_SWSYNCG          BIT(2)                                     /*!< Software synchronization event generation */

/* TIMERx_CINITV */
#define TIMER_CINITV_CINITVAL           BITS(0,15)                                 /*!< Counter initial value */

/* TIMERx_CHMECAPCFG */
#define TIMER_CHMECAPCFG_CH0MEBL        BITS(0,1)                                  /*!< Channel 0 multi edge buffer level */
#define TIMER_CHMECAPCFG_CH1MEBL        BITS(2,3)                                  /*!< Channel 1 multi edge buffer level */
#define TIMER_CHMECAPCFG_CH2MEBL        BITS(4,5)                                  /*!< Channel 2 multi edge buffer level */
#define TIMER_CHMECAPCFG_CH3MEBL        BITS(6,7)                                  /*!< Channel 3 multi edge buffer level */
#define TIMER_CHMECAPCFG_CH0MECEN       BIT(16)                                    /*!< Channel 0 multi edge capture enable */
#define TIMER_CHMECAPCFG_CH1MECEN       BIT(17)                                    /*!< Channel 1 multi edge capture enable */
#define TIMER_CHMECAPCFG_CH2MECEN       BIT(18)                                    /*!< Channel 2 multi edge capture enable */
#define TIMER_CHMECAPCFG_CH3MECEN       BIT(19)                                    /*!< Channel 3 multi edge capture enable */
#define TIMER_CHMECAPCFG_CH0MECP        BITS(20,21)                                /*!< Channel 0 multi edge capture polarity */
#define TIMER_CHMECAPCFG_CH1MECP        BITS(22,23)                                /*!< Channel 1 multi edge capture polarity */
#define TIMER_CHMECAPCFG_CH2MECP        BITS(24,25)                                /*!< Channel 2 multi edge capture polarity */
#define TIMER_CHMECAPCFG_CH3MECP        BITS(26,27)                                /*!< Channel 3 multi edge capture polarity */

/* TIMERx_MCHMECAPCFG */
#define TIMER_MCHMECAPCFG_MCH0MEBL      BITS(0,1)                                   /*!< Multi mode channel 0 multi edge buffer level */
#define TIMER_MCHMECAPCFG_MCH1MEBL      BITS(2,3)                                   /*!< Multi mode channel 1 multi edge buffer level */
#define TIMER_MCHMECAPCFG_MCH2MEBL      BITS(4,5)                                   /*!< Multi mode channel 2 multi edge buffer level */
#define TIMER_MCHMECAPCFG_MCH3MEBL      BITS(6,7)                                   /*!< Multi mode channel 3 multi edge buffer level */
#define TIMER_MCHMECAPCFG_MCH0MECEN     BIT(16)                                     /*!< Multi mode channel 0 multi edge capture enable */
#define TIMER_MCHMECAPCFG_MCH1MECEN     BIT(17)                                     /*!< Multi mode channel 1 multi edge capture enable */
#define TIMER_MCHMECAPCFG_MCH2MECEN     BIT(18)                                     /*!< Multi mode channel 2 multi edge capture enable */
#define TIMER_MCHMECAPCFG_MCH3MECEN     BIT(19)                                     /*!< Multi mode channel 3 multi edge capture enable */
#define TIMER_MCHMECAPCFG_MCH0MECP      BITS(20,21)                                 /*!< Multi mode channel 0 multi edge capture polarity */
#define TIMER_MCHMECAPCFG_MCH1MECP      BITS(22,23)                                 /*!< Multi mode channel 1 multi edge capture polarity */
#define TIMER_MCHMECAPCFG_MCH2MECP      BITS(24,25)                                 /*!< Multi mode channel 2 multi edge capture polarity */
#define TIMER_MCHMECAPCFG_MCH3MECP      BITS(26,27)                                 /*!< Multi mode channel 3 multi edge capture polarity */

/* TIMERx_CH0MECAP */
#define TIMER_CH0MECAP_CH0CAP3          BITS(0,15)                                  /*!< Channel 0 captures 3 count values */
#define TIMER_CH0MECAP_CH0CAP4          BITS(16,31)                                 /*!< Channel 0 captures 4 count values */

/* TIMERx_CH1MECAP */
#define TIMER_CH1MECAP_CH1CAP3          BITS(0,15)                                  /*!< Channel 1 captures 3 count values */
#define TIMER_CH1MECAP_CH1CAP4          BITS(16,31)                                 /*!< Channel 1 captures 4 count values */

/* TIMERx_CH2MECAP */
#define TIMER_CH2MECAP_CH2CAP3          BITS(0,15)                                  /*!< Channel 2 captures 3 count values */
#define TIMER_CH2MECAP_CH2CAP4          BITS(16,31)                                 /*!< Channel 2 captures 4 count values */

/* TIMERx_CH3MECAP */
#define TIMER_CH3MECAP_CH3CAP3          BITS(0,15)                                  /*!< Channel 3 captures 3 count values */
#define TIMER_CH3MECAP_CH3CAP4          BITS(16,31)                                 /*!< Channel 3 captures 4 count values */

