sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* TIMERx_MCH0MECAP */
#define TIMER_MCH0MECAP_MCH0CAP3        BITS(0,15)                                  /*!< Multi mode channel 0 captures 3 count values */
#define TIMER_MCH0MECAP_MCH0CAP4        BITS(16,31)                                 /*!< Multi mode channel 0 captures 4 count values */

/* TIMERx_MCH1MECAP */
#define TIMER_MCH1MECAP_MCH1CAP3        BITS(0,15)                                  /*!< Multi mode channel 1 captures 3 count values */
#define TIMER_MCH1MECAP_MCH1CAP4        BITS(16,31)                                 /*!< Multi mode channel 1 captures 4 count values */

/* TIMERx_MCH2MECAP */
#define TIMER_MCH2MECAP_MCH2CAP3        BITS(0,15)                                  /*!< Multi mode channel 2 captures 3 count values */
#define TIMER_MCH2MECAP_MCH2CAP4        BITS(16,31)                                 /*!< Multi mode channel 2 captures 4 count values */

/* TIMERx_MCH3MECAP */
#define TIMER_MCH3MECAP_MCH3CAP3        BITS(0,15)                                  /*!< Multi mode channel 3 captures 3 count values */
#define TIMER_MCH3MECAP_MCH3CAP4        BITS(16,31)                                 /*!< Multi mode channel 3 captures 4 count values */

/* TIMER_DMACFG */
#define TIMER_DMACFG_DMATA               BITS(0,5)                                  /*!< DMA transfer access start address */
#define TIMER_DMACFG_DMATC               BITS(8,13)                                 /*!< DMA transfer count */

/* TIMER_DMATB */
#define TIMER_DMATB_DMATB                BITS(0,31)                                 /*!< DMA transfer buffer address */

/* TIMER_CFG */
#define TIMER_CFG_OUTSEL                 BIT(0)                                     /*!< the output value selection */
#define TIMER_CFG_CHVSEL                 BIT(1)                                     /*!< write CHxVAL register selection */
#define TIMER_CFG_CCUSEL                 BIT(3)                                     /*!< Commutation control shadow register update selection */
#define TIMER_CFG_RDSEL                  BIT(4)                                     /*!< Current configuration value OR The shadow register value in effect */

/* TIMER_CHMECAPCFG */
#define TIMER_CHxMEBL(ch, buffer)        ((uint32_t)(buffer << (ch * 2)))           /*!< channel x multi edge buffer level */
#define TIMER_CH0MECEN                   ((uint32_t)(~(BIT(16))))                   /*!< channel 0 multi edge capture enable */
#define TIMER_CH1MECEN                   ((uint32_t)(~(BIT(17))))                   /*!< channel 1 multi edge capture enable */
#define TIMER_CH2MECEN                   ((uint32_t)(~(BIT(18))))                   /*!< channel 2 multi edge capture enable */
#define TIMER_CH3MECEN                   ((uint32_t)(~(BIT(19))))                   /*!< channel 2 multi edge capture enable */
#define TIMER_CHxMECP(ch, polarity)      ((uint32_t)(polarity << (20 + ch * 2)))    /*!< channel x multi edge capture polarity set */

/* TIMER_CASCH */
#define TIMER_CASCH_CASCH                BITS(0,31)                                 /*!< high 32 bits of the 64bit counter in cascade mode */

/* TIMER_CASCL */
#define TIMER_CASCL_CASCL                BITS(0,31)                                 /*!< low 32 bits of the 64bit counter in cascade mode */

/* constants definitions */
/* TIMER init parameter struct definitions */
typedef struct {
    uint16_t prescaler;                                                             /*!< prescaler value */
    uint16_t alignedmode;                                                           /*!< aligned mode */
    uint16_t counterdirection;                                                      /*!< counter direction */
    uint32_t period;                                                                /*!< period value */
    uint16_t clockdivision;                                                         /*!< clock division value */
    uint8_t  repetitioncounter;                                                     /*!< the counter repetition value */
} timer_parameter_struct;

/* break parameter struct definitions */
typedef struct {
    uint16_t runoffstate;                                                           /*!< run mode off-state */
    uint16_t ideloffstate;                                                          /*!< idle mode off-state */
    uint16_t deadtime;                                                              /*!< dead time */
    uint16_t breakpolarity;                                                         /*!< break polarity */
    uint16_t outputautostate;                                                       /*!< output automatic enable */
    uint16_t protectmode;                                                           /*!< complementary register protect control */
    uint16_t breakstate;                                                            /*!< break enable */
    uint32_t dtshadow;
} timer_break_parameter_struct;

/* channel output parameter struct definitions */
typedef struct {
    uint16_t outputstate;                                                           /*!< channel output state */
    uint16_t outputnstate;                                                          /*!< channel complementary output state */
    uint16_t ocpolarity;                                                            /*!< channel output polarity */
    uint16_t ocnpolarity;                                                           /*!< channel complementary output polarity */
    uint16_t ocidlestate;                                                           /*!< idle state of channel output */
    uint16_t ocnidlestate;                                                          /*!< idle state of channel complementary output */
} timer_oc_parameter_struct;

/* multi mode channel output parameter struct definitions */
typedef struct {
    uint16_t outputmode;                                                            /*!< multi mode channel output mode selection */
    uint16_t outputstate;                                                           /*!< multi mode channel output state */
    uint16_t ocpolarity;                                                            /*!< multi mode channel output polarity */
} timer_omc_parameter_struct;

/* channel input parameter struct definitions */
typedef struct {
    uint16_t icpolarity;                                                            /*!< channel input polarity */
    uint16_t icselection;                                                           /*!< channel input mode selection */
    uint16_t icprescaler;                                                           /*!< channel input capture prescaler */
    uint16_t icfilter;                                                              /*!< channel input capture filter control */
} timer_ic_parameter_struct;

