sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* break external input parameter struct definitions */
typedef struct {
    uint32_t filter;                                                                /*!< break external input filter */
    ControlStatus enable;                                                                /*!< break external input enable */
    uint32_t polarity;                                                              /*!< break external input polarity */
} timer_break_ext_input_struct;

/* channel free complementary parameter struct definitions */
typedef struct {
    uint32_t freecomstate;                                                          /*!< free complementary channel protection enable */
    uint32_t dtshadow;                                                              /*!< deadtime shadow enable */
    uint32_t runoffstate;                                                           /*!< run mode off-state */
    uint32_t ideloffstate;                                                          /*!< idle mode off-state */
    uint32_t deadtime;                                                              /*!< dead time */
} timer_free_complementary_parameter_struct;

/* channel asymmetric pwm parameter definitions */
typedef struct {
    uint32_t pwmasymode;                                                            /*!< asymmetric pwm mode */
    ControlStatus enable;                                                           /*!< asymmetric pwm enable */
    uint32_t dir;                                                                   /*!< counter direction */
    uint32_t capval;                                                                /*!< CHxVAL value */
    uint32_t addval;                                                                /*!< CHxCOMVAL_ADD value */
} timer_channel_asymmetric_pwm_mode_struct;

/* define the CAN bit position and its register index offset */
#define TIMER_REGIDX_BIT(regidx, bitpos) (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define TIMER_REG_VAL(canx, offset)      (REG32((uint32_t)(canx) + ((uint32_t)(offset) >> 6U)))
#define TIMER_BIT_POS(val)               ((uint32_t)(val) & 0x0000001FU)

/* register offset */
#define DMAINTEN0_REG_OFFSET                ((uint32_t)0x0000000CU)                 /*!< DMAINTEN0 register offset */
#define DMAINTEN1_REG_OFFSET                ((uint32_t)0x0000008CU)                 /*!< DMAINTEN1 register offset */
#define DMAINTEN_REG_OFFSET                 ((uint32_t)0x0000000CU)                 /*!< DMAINTEN register offset */

/* TIMER interrupt enable or disable */
typedef enum {
    /* interrupt in DMAINTEN0 register */
    TIMER_INT_UP                             = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 0U),     /*!< update interrupt */
    TIMER_INT_CH0                            = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 1U),     /*!< channel 0 capture or compare interrupt */
    TIMER_INT_CH1                            = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 2U),     /*!< channel 1 capture or compare interrupt */
    TIMER_INT_CH2                            = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 3U),     /*!< channel 2 capture or compare interrupt */
    TIMER_INT_CH3                            = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 4U),     /*!< channel 3 capture or compare interrupt */
    TIMER_INT_CMT                            = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 5U),     /*!< channel commutation interrupt flag */
    TIMER_INT_TRG                            = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 6U),     /*!< trigger interrupt */
    TIMER_INT_BRK                            = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 7U),     /*!< break interrupt */
    TIMER_INT_DECJ                           = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 16U),    /*!< quadrature decoder signal jump (the two signals jump at the same time) interrupt */
    TIMER_INT_DECDIS                         = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 17U),    /*!< quadrature decoder signal disconnection interrupt */
    TIMER_INT_MCH0                           = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 20U),    /*!< multi mode channel 0 capture or compare interrupt */
    TIMER_INT_MCH1                           = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 21U),    /*!< multi mode channel 1 capture or compare interrupt */
    TIMER_INT_MCH2                           = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 22U),    /*!< multi mode channel 2 capture or compare interrupt */
    TIMER_INT_MCH3                           = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 23U),    /*!< multi mode channel 3 capture or compare interrupt */
    TIMER_INT_CH0COMADD                      = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 28U),    /*!< channel 0 additional compare interrupt */
    TIMER_INT_CH1COMADD                      = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 29U),    /*!< channel 1 additional compare interrupt */
    TIMER_INT_CH2COMADD                      = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 30U),    /*!< channel 2 additional compare interrupt */
    TIMER_INT_CH3COMADD                      = TIMER_REGIDX_BIT(DMAINTEN0_REG_OFFSET, 31U),    /*!< channel 3 additional compare interrupt */
    TIMER_INT_MCH0COMADD                     = TIMER_REGIDX_BIT(DMAINTEN1_REG_OFFSET, 0U),     /*!< multi mode channel 0 additional compare interrupt */
    TIMER_INT_MCH1COMADD                     = TIMER_REGIDX_BIT(DMAINTEN1_REG_OFFSET, 1U),     /*!< multi mode channel 1 additional compare interrupt */
    TIMER_INT_MCH2COMADD                     = TIMER_REGIDX_BIT(DMAINTEN1_REG_OFFSET, 2U),     /*!< multi mode channel 2 additional compare interrupt */
    TIMER_INT_MCH3COMADD                     = TIMER_REGIDX_BIT(DMAINTEN1_REG_OFFSET, 3U),     /*!< multi mode channel 3 additional compare interrupt */
    TIMER_INT_UP0                            = TIMER_REGIDX_BIT(DMAINTEN_REG_OFFSET, 0U),      /*!< update interrupt of channel 0 */
    TIMER_INT_UP1                            = TIMER_REGIDX_BIT(DMAINTEN_REG_OFFSET, 1U),      /*!< update interrupt of channel 1 */
    TIMER_INT_UP2                            = TIMER_REGIDX_BIT(DMAINTEN_REG_OFFSET, 2U),      /*!< update interrupt of channel 2 */
    TIMER_INT_UP3                            = TIMER_REGIDX_BIT(DMAINTEN_REG_OFFSET, 3U)       /*!< update interrupt of channel 3 */
} timer_interrupt_enum;

/* TIMER flag */
#define TIMER_INT_FLAG_UP                   TIMER_INTF_UPIF                          /*!< update flag */
#define TIMER_INT_FLAG_CH0                  TIMER_INTF_CH0IF                         /*!< channel 0 capture or compare flag */
#define TIMER_INT_FLAG_CH1                  TIMER_INTF_CH1IF                         /*!< channel 1 capture or compare flag */
#define TIMER_INT_FLAG_CH2                  TIMER_INTF_CH2IF                         /*!< channel 2 capture or compare flag */
#define TIMER_INT_FLAG_CH3                  TIMER_INTF_CH3IF                         /*!< channel 3 capture or compare flag */
#define TIMER_INT_FLAG_CMT                  TIMER_INTF_CMTIF                         /*!< channel commutation flag */
#define TIMER_INT_FLAG_TRG                  TIMER_INTF_TRGIF                         /*!< trigger flag */
#define TIMER_INT_FLAG_BRK                  TIMER_INTF_BRKIF                         /*!< break flag */
#define TIMER_INT_FLAG_CH0O                 TIMER_INTF_CH0OF                         /*!< channel 0 overcapture flag */
#define TIMER_INT_FLAG_CH1O                 TIMER_INTF_CH1OF                         /*!< channel 1 overcapture flag */
#define TIMER_INT_FLAG_CH2O                 TIMER_INTF_CH2OF                         /*!< channel 2 overcapture flag */
#define TIMER_INT_FLAG_CH3O                 TIMER_INTF_CH3OF                         /*!< channel 3 overcapture flag */
#define TIMER_INT_FLAG_SYSB                 TIMER_INTF_SYSBIF                        /*!< system source break interrupt flag */
#define TIMER_INT_FLAG_DECJ                 TIMER_INTF_DECJIF                        /*!< quadrature decoder signal jump (the two signals jump at the same time) interrupt flag */
#define TIMER_INT_FLAG_DECDIS               TIMER_INTF_DECDISIF                      /*!< quadrature decoder signal disconnection interrupt flag */
#define TIMER_INT_FLAG_MCH0                 TIMER_INTF_MCH0IF                        /*!< multi mode channel 0 capture or compare flag */
#define TIMER_INT_FLAG_MCH1                 TIMER_INTF_MCH1IF                        /*!< multi mode channel 1 capture or compare flag */
#define TIMER_INT_FLAG_MCH2                 TIMER_INTF_MCH2IF                        /*!< multi mode channel 2 capture or compare flag */
#define TIMER_INT_FLAG_MCH3                 TIMER_INTF_MCH3IF                        /*!< multi mode channel 3 capture or compare flag */
#define TIMER_INT_FLAG_MCH0O                TIMER_INTF_MCH0OF                        /*!< multi mode channel 0 overcapture flag */
#define TIMER_INT_FLAG_MCH1O                TIMER_INTF_MCH1OF                        /*!< multi mode channel 1 overcapture flag */
#define TIMER_INT_FLAG_MCH2O                TIMER_INTF_MCH2OF                        /*!< multi mode channel 2 overcapture flag */
#define TIMER_INT_FLAG_MCH3O                TIMER_INTF_MCH3OF                        /*!< multi mode channel 3 overcapture flag */
#define TIMER_INT_FLAG_CH0COMADD            TIMER_INTF_CH0COMADDIF                   /*!< channel 0 additional compare interrupt flag */
#define TIMER_INT_FLAG_CH1COMADD            TIMER_INTF_CH1COMADDIF                   /*!< channel 1 additional compare interrupt flag */
#define TIMER_INT_FLAG_CH2COMADD            TIMER_INTF_CH2COMADDIF                   /*!< channel 2 additional compare interrupt flag */
#define TIMER_INT_FLAG_CH3COMADD            TIMER_INTF_CH3COMADDIF                   /*!< channel 3 additional compare interrupt flag */
#define TIMER_INT_FLAG_MCH0COMADD           TIMER_INTF_MCH0COMADDIF                  /*!< multi mode channel 0 additional compare interrupt flag */
#define TIMER_INT_FLAG_MCH1COMADD           TIMER_INTF_MCH1COMADDIF                  /*!< multi mode channel 1 additional compare interrupt flag */
#define TIMER_INT_FLAG_MCH2COMADD           TIMER_INTF_MCH2COMADDIF                  /*!< multi mode channel 2 additional compare interrupt flag */
#define TIMER_INT_FLAG_MCH3COMADD           TIMER_INTF_MCH3COMADDIF                  /*!< multi mode channel 3 additional compare interrupt flag */
#define TIMER_INT_FLAG_UP0                  TIMER_INTF_UPIF0                         /*!< update interrupt flag of channel 0 */
#define TIMER_INT_FLAG_UP1                  TIMER_INTF_UPIF1                         /*!< update interrupt flag of channel 1 */
#define TIMER_INT_FLAG_UP2                  TIMER_INTF_UPIF2                         /*!< update interrupt flag of channel 2 */
#define TIMER_INT_FLAG_UP3                  TIMER_INTF_UPIF3                         /*!< update interrupt flag of channel 3 */

/* TIMER flag */
#define TIMER_FLAG_UP                       TIMER_INTF_UPIF                          /*!< update flag */
#define TIMER_FLAG_CH0                      TIMER_INTF_CH0IF                         /*!< channel 0 capture or compare flag */
#define TIMER_FLAG_CH1                      TIMER_INTF_CH1IF                         /*!< channel 1 capture or compare flag */
#define TIMER_FLAG_CH2                      TIMER_INTF_CH2IF                         /*!< channel 2 capture or compare flag */
#define TIMER_FLAG_CH3                      TIMER_INTF_CH3IF                         /*!< channel 3 capture or compare flag */
#define TIMER_FLAG_CMT                      TIMER_INTF_CMTIF                         /*!< channel commutation flag */
#define TIMER_FLAG_TRG                      TIMER_INTF_TRGIF                         /*!< trigger flag */
#define TIMER_FLAG_BRK                      TIMER_INTF_BRKIF                         /*!< break flag */
#define TIMER_FLAG_CH0O                     TIMER_INTF_CH0OF                         /*!< channel 0 overcapture flag */
#define TIMER_FLAG_CH1O                     TIMER_INTF_CH1OF                         /*!< channel 1 overcapture flag */
#define TIMER_FLAG_CH2O                     TIMER_INTF_CH2OF                         /*!< channel 2 overcapture flag */
#define TIMER_FLAG_CH3O                     TIMER_INTF_CH3OF                         /*!< channel 3 overcapture flag */
#define TIMER_FLAG_SYSB                     TIMER_INTF_SYSBIF                        /*!< system source break flag */
#define TIMER_FLAG_DECJ                     TIMER_INTF_DECJIF                        /*!< quadrature decoder signal jump (the two signals jump at the same time) flag */
#define TIMER_FLAG_DECDIS                   TIMER_INTF_DECDISIF                      /*!< quadrature decoder signal disconnection flag */
#define TIMER_FLAG_MCH0                     TIMER_INTF_MCH0IF                        /*!< multi mode channel 0 capture or compare flag */
#define TIMER_FLAG_MCH1                     TIMER_INTF_MCH1IF                        /*!< multi mode channel 1 capture or compare flag */
#define TIMER_FLAG_MCH2                     TIMER_INTF_MCH2IF                        /*!< multi mode channel 2 capture or compare flag */
#define TIMER_FLAG_MCH3                     TIMER_INTF_MCH3IF                        /*!< multi mode channel 3 capture or compare flag */
#define TIMER_FLAG_MCH0O                    TIMER_INTF_MCH0OF                        /*!< multi mode channel 0 overcapture flag */
#define TIMER_FLAG_MCH1O                    TIMER_INTF_MCH1OF                        /*!< multi mode channel 1 overcapture flag */
#define TIMER_FLAG_MCH2O                    TIMER_INTF_MCH2OF                        /*!< multi mode channel 2 overcapture flag */
#define TIMER_FLAG_MCH3O                    TIMER_INTF_MCH3OF                        /*!< multi mode channel 3 overcapture flag */
#define TIMER_FLAG_CH0COMADD                TIMER_INTF_CH0COMADDIF                   /*!< channel 0 additional compare interrupt flag */
#define TIMER_FLAG_CH1COMADD                TIMER_INTF_CH1COMADDIF                   /*!< channel 1 additional compare interrupt flag */
#define TIMER_FLAG_CH2COMADD                TIMER_INTF_CH2COMADDIF                   /*!< channel 2 additional compare interrupt flag */
#define TIMER_FLAG_CH3COMADD                TIMER_INTF_CH3COMADDIF                   /*!< channel 3 additional compare interrupt flag */
#define TIMER_FLAG_MCH0COMADD               TIMER_INTF_MCH0COMADDIF                  /*!< multi mode channel 0 additional compare interrupt flag */
#define TIMER_FLAG_MCH1COMADD               TIMER_INTF_MCH1COMADDIF                  /*!< multi mode channel 1 additional compare interrupt flag */
#define TIMER_FLAG_MCH2COMADD               TIMER_INTF_MCH2COMADDIF                  /*!< multi mode channel 2 additional compare interrupt flag */
#define TIMER_FLAG_MCH3COMADD               TIMER_INTF_MCH3COMADDIF                  /*!< multi mode channel 3 additional compare interrupt flag */
#define TIMER_FLAG_UP0                      TIMER_INTF_UPIF0                         /*!< update flag of channel 0 */
#define TIMER_FLAG_UP1                      TIMER_INTF_UPIF1                         /*!< update flag of channel 1 */
#define TIMER_FLAG_UP2                      TIMER_INTF_UPIF2                         /*!< update flag of channel 2 */
#define TIMER_FLAG_UP3                      TIMER_INTF_UPIF3                         /*!< update flag of channel 3 */

/* TIMER DMA source */
#define TIMER_DMA_UPD                       TIMER_DMAINTEN0_UPDEN                    /*!< update DMA request */
#define TIMER_DMA_CH0D                      TIMER_DMAINTEN0_CH0DEN                   /*!< channel 0 capture or compare DMA request */
#define TIMER_DMA_CH1D                      TIMER_DMAINTEN0_CH1DEN                   /*!< channel 1 capture or compare DMA request */
#define TIMER_DMA_CH2D                      TIMER_DMAINTEN0_CH2DEN                   /*!< channel 2 capture or compare DMA request */
#define TIMER_DMA_CH3D                      TIMER_DMAINTEN0_CH3DEN                   /*!< channel 3 capture or compare DMA request */
#define TIMER_DMA_CMTD                      TIMER_DMAINTEN0_CMTDEN                   /*!< commutation DMA request */
#define TIMER_DMA_TRGD                      TIMER_DMAINTEN0_TRGDEN                   /*!< trigger DMA request */
#define TIMER_DMA_MCH0D                     TIMER_DMAINTEN0_MCH0DEN                  /*!< multi mode channel 0 capture or compare DMA request */
#define TIMER_DMA_MCH1D                     TIMER_DMAINTEN0_MCH1DEN                  /*!< multi mode channel 1 capture or compare DMA request */
#define TIMER_DMA_MCH2D                     TIMER_DMAINTEN0_MCH2DEN                  /*!< multi mode channel 2 capture or compare DMA request */
#define TIMER_DMA_MCH3D                     TIMER_DMAINTEN0_MCH3DEN                  /*!< multi mode channel 3 capture or compare DMA request */
#define TIMER_DMA_UPD0                      TIMER_DMAINTEN_UPDEN0                    /*!< update DMA request of channel 0 */
#define TIMER_DMA_UPD1                      TIMER_DMAINTEN_UPDEN1                    /*!< update DMA request of channel 1 */
#define TIMER_DMA_UPD2                      TIMER_DMAINTEN_UPDEN2                    /*!< update DMA request of channel 2 */
#define TIMER_DMA_UPD3                      TIMER_DMAINTEN_UPDEN3                    /*!< update DMA request of channel 3 */

