sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* idle state of multi mode channel output */
#define TIMER_OMC_IDLE_STATE_HIGH           ((uint16_t)0x0100U)                     /*!< idle state of multi mode channel output is high */
#define TIMER_OMC_IDLE_STATE_LOW            ((uint16_t)0x0000U)                     /*!< idle state of multi mode channel output is low */

/* channel output compare mode */
#define TIMER_OC_MODE_TIMING                ((uint32_t)0x00000U)                    /*!< timing mode */
#define TIMER_OC_MODE_ACTIVE                ((uint32_t)0x00010U)                    /*!< active mode */
#define TIMER_OC_MODE_INACTIVE              ((uint32_t)0x00020U)                    /*!< inactive mode */
#define TIMER_OC_MODE_TOGGLE                ((uint32_t)0x00030U)                    /*!< toggle mode */
#define TIMER_OC_MODE_LOW                   ((uint32_t)0x00040U)                    /*!< force low mode */
#define TIMER_OC_MODE_HIGH                  ((uint32_t)0x00050U)                    /*!< force high mode */
#define TIMER_OC_MODE_PWM0                  ((uint32_t)0x00060U)                    /*!< PWM mode 0 */
#define TIMER_OC_MODE_PWM1                  ((uint32_t)0x00070U)                    /*!< PWM mode 1 */
#define TIMER_OC_MODE_CMP_PWM0              ((uint32_t)0x10000U)                    /*!< Composite PWM mode 0 */
#define TIMER_OC_MODE_CMP_PWM1              ((uint32_t)0x10010U)                    /*!< Composite PWM mode 1 */
#define TIMER_OC_MODE_ASYM_PWM0             ((uint32_t)0x10020U)                    /*!< Asymmetric PWM mode 0 */
#define TIMER_OC_MODE_ASYM_PWM1             ((uint32_t)0x10030U)                    /*!< Asymmetric PWM mode 1 */

/* channel output compare shadow enable */
#define TIMER_OC_SHADOW_ENABLE              ((uint16_t)0x0008U)                     /*!< channel output compare shadow enable */
#define TIMER_OC_SHADOW_DISABLE             ((uint16_t)0x0000U)                     /*!< channel output compare shadow disable */

/* channel output compare clear enable */
#define TIMER_OC_CLEAR_ENABLE               ((uint16_t)0x0080U)                     /*!< channel output clear function enable */
#define TIMER_OC_CLEAR_DISABLE              ((uint16_t)0x0000U)                     /*!< channel output clear function disable */

/* channel output compare fast enable */
#define TIMER_OC_FAST_ENABLE                ((uint16_t)0x0004U)                     /*!< channel output compare fast function enable */
#define TIMER_OC_FAST_DISABLE               ((uint16_t)0x0000U)                     /*!< channel output compare fast function disable */

/* channel control shadow register update control */
#define TIMER_UPDATECTL_CCU                 ((uint32_t)0x00000000U)                 /*!< the shadow registers update by when CMTG bit is set */
#define TIMER_UPDATECTL_CCUTRI              TIMER_CTL1_CCUC                         /*!< the shadow registers update by when CMTG bit is set or an rising edge of TRGI occurs */

/* channel input capture polarity */
#define TIMER_IC_POLARITY_RISING            ((uint16_t)0x0000U)                     /*!< input capture rising edge */
#define TIMER_IC_POLARITY_FALLING           ((uint16_t)0x0002U)                     /*!< input capture falling edge*/
#define TIMER_IC_POLARITY_BOTH_EDGE         ((uint16_t)0x000AU)                     /*!< input capture both edge */

/* TIMER input capture selection */
#define TIMER_IC_SELECTION_DIRECTTI         ((uint16_t)0x0001U)                     /*!< channel n is configured as input and icy is mapped on CIy / CINy */
#define TIMER_IC_SELECTION_INDIRECTTI       ((uint16_t)0x0002U)                     /*!< channel n is configured as input and icy is mapped on opposite input */
#define TIMER_IC_SELECTION_ITS              ((uint16_t)0x0003U)                     /*!< channel n is configured as input and icy is mapped on ITS */
#define TIMER_IC_SELECTION_PAIR             ((uint16_t)0x0004U)                     /*!< channel n is configured as input and icy is mapped on the other channel of same pair */

/* channel input capture prescaler */
#define TIMER_IC_PSC_DIV1                   ((uint16_t)0x0000U)                     /*!< no prescaler */
#define TIMER_IC_PSC_DIV2                   ((uint16_t)0x0004U)                     /*!< divided by 2 */
#define TIMER_IC_PSC_DIV4                   ((uint16_t)0x0008U)                     /*!< divided by 4 */
#define TIMER_IC_PSC_DIV8                   ((uint16_t)0x000CU)                     /*!< divided by 8 */

/* channel input multi capture polarity */
#define TIMER_IC_MULTI_POLARITY_RISING      ((uint16_t)0x0000U)                     /*!< effective edge of the first capture is the rising edge */
#define TIMER_IC_MULTI_POLARITY_FALLING     ((uint16_t)0x0001U)                     /*!< effective edge captured for the first time is the falling edge */
#define TIMER_IC_MULTI_POLARITY_BOTH_EDGE   ((uint16_t)0x0003U)                     /*!< effective edge captured for the first time is the edge of any polarity */

/* TIMER multi edge capture time(bugffer level) define */
#define TIMER_IC_MULTI_BUFF_LEVEL_1         ((uint8_t)0x00U)                        /*!< capture interrupt is ouccer after one capture */
#define TIMER_IC_MULTI_BUFF_LEVEL_2         ((uint8_t)0x01U)                        /*!< capture interrupt is ouccer after two capture */
#define TIMER_IC_MULTI_BUFF_LEVEL_3         ((uint8_t)0x02U)                        /*!< capture interrupt is ouccer after three capture */
#define TIMER_IC_MULTI_BUFF_LEVEL_4         ((uint8_t)0x03U)                        /*!< capture interrupt is ouccer after four capture */

#define TIMER_CTL0_CAM_EDGE                 ((uint32_t)0x00000000U)                 /*!< No center-aligned mode */
#define TIMER_CTL0_CAM_CENTER_DOWN          ((uint32_t)0x00000001U)                 /*!< Center-aligned and counting down assert mode */
#define TIMER_CTL0_CAM_CENTER_UP            ((uint32_t)0x00000002U)                 /*!< Center-aligned and counting up assert mode */
#define TIMER_CTL0_CAM_CENTER_BOTH          ((uint32_t)0x00000003U)                 /*!< Center-aligned and counting up/down assert mode */

