sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* master mode control */
#define CTL1_MMC(regval)                    ((BITS(4,6) & ((uint32_t)(regval) << 4U)) | (BIT(25) & ((uint32_t)(regval) << 22U)))
#define TIMER_TRI_OUT_SRC_RESET             CTL1_MMC(0)                             /*!< the UPG bit as trigger output */
#define TIMER_TRI_OUT_SRC_ENABLE            CTL1_MMC(1)                             /*!< the counter enable signal as trigger output */
#define TIMER_TRI_OUT_SRC_UPDATE            CTL1_MMC(2)                             /*!< update event as trigger output */
#define TIMER_TRI_OUT_SRC_CH0               CTL1_MMC(3)                             /*!< a capture or a compare match occurred in channel 0 as trigger output TRGO */
#define TIMER_TRI_OUT_SRC_O0CPRE            CTL1_MMC(4)                             /*!< O0CPRE as trigger output */
#define TIMER_TRI_OUT_SRC_O1CPRE            CTL1_MMC(5)                             /*!< O1CPRE as trigger output */
#define TIMER_TRI_OUT_SRC_O2CPRE            CTL1_MMC(6)                             /*!< O2CPRE as trigger output */
#define TIMER_TRI_OUT_SRC_O3CPRE            CTL1_MMC(7)                             /*!< O3CPRE as trigger output */
#define TIMER_TRI_OUT_SRC_OVERFLOW          CTL1_MMC(9)                             /*!< overflow event as trigger output */
#define TIMER_TRI_OUT_SRC_UNDERFLOW         CTL1_MMC(10)                            /*!< underflow event as trigger output */
#define TIMER_TRI_OUT_SRC_SWEVENT           CTL1_MMC(11)                            /*!< software event as trigger output */

/* master channel selection */
#define TIMER_MASTER_CHANNEL_0              ((uint32_t)0x00000000U)                 /*!< timer master channel 0 */
#define TIMER_MASTER_CHANNEL_1              ((uint32_t)0x00000001U)                 /*!< timer master channel 1 */
#define TIMER_MASTER_CHANNEL_2              ((uint32_t)0x00000002U)                 /*!< timer master channel 2 */
#define TIMER_MASTER_CHANNEL_3              ((uint32_t)0x00000003U)                 /*!< timer master channel 3 */

/* master slave mode selection */
#define TIMER_MASTER_SLAVE_MODE_ENABLE      TIMER_SMCFG_MSM                         /*!< master slave mode enable */
#define TIMER_MASTER_SLAVE_MODE_DISABLE     ((uint32_t)0x00000000U)                 /*!< master slave mode disable */

/* external trigger source */
#define SMCFG_ETISEL(regval)                (BITS(28,29) & ((uint32_t)(regval) << 28U))
#define TIMER_EXTERNAL_TRIGGER_0            SMCFG_ETISEL(0)                         /*!< timer external trigger 0 */
#define TIMER_EXTERNAL_TRIGGER_1            SMCFG_ETISEL(1)                         /*!< timer external trigger 1 */
#define TIMER_EXTERNAL_TRIGGER_2            SMCFG_ETISEL(2)                         /*!< timer external trigger 2 */

/* external trigger prescaler */
#define SMCFG_ETPSC(regval)                 (BITS(12,13) & ((uint32_t)(regval) << 12U))
#define TIMER_EXT_TRI_PSC_OFF               SMCFG_ETPSC(0)                          /*!< no divided */
#define TIMER_EXT_TRI_PSC_DIV2              SMCFG_ETPSC(1)                          /*!< divided by 2 */
#define TIMER_EXT_TRI_PSC_DIV4              SMCFG_ETPSC(2)                          /*!< divided by 4 */
#define TIMER_EXT_TRI_PSC_DIV8              SMCFG_ETPSC(3)                          /*!< divided by 8 */

/* external trigger polarity */
#define TIMER_ETP_FALLING                   TIMER_SMCFG_ETP                         /*!< active low or falling edge active */
#define TIMER_ETP_RISING                    ((uint32_t)0x00000000U)                 /*!< active high or rising edge active */

/* channel 0 trigger input selection */
#define TIMER_HALLINTERFACE_ENABLE          TIMER_CTL1_TI0S                         /*!< TIMER hall sensor mode enable */
#define TIMER_HALLINTERFACE_DISABLE         ((uint32_t)0x00000000U)                 /*!< TIMER hall sensor mode disable */

/* TIMER1 channel 0 input remap */
#define IRMP_CI0_RMP(regval)                (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define TIMER_CI0_RMP_GPIO                  IRMP_CI0_RMP(0)                         /*!< TIMER channel 0 input remap to GPIO pin */
#define TIMER_CI0_RMP_LXTAL                 IRMP_CI0_RMP(1)                         /*!< TIMER channel 0 input remap to LXTAL */
#define TIMER_CI0_RMP_HXTAL                 IRMP_CI0_RMP(2)                         /*!< TIMER channel 0 input remap to HXTAL/128 */
#define TIMER_CI0_RMP_CKOUT0SEL             IRMP_CI0_RMP(3)                         /*!< TIMER channel 0 input remap to CKOUT0SEL */

/* TIMER read selection */
#define TIMER_RDSEL_ENABLE                 ((uint16_t)TIMER_CFG_RDSEL)              /*!< read selection enable */
#define TIMER_RDSEL_DISABLE                ((uint16_t)0x0000U)                      /*!< read selection disable */

/* TIMER commutation control shadow register update selection */
#define TIMER_CCUSEL_ENABLE                 ((uint16_t)TIMER_CFG_CCUSEL)            /*!< commutation control shadow register update selection enable */
#define TIMER_CCUSEL_DISABLE                ((uint16_t)0x0000U)                     /*!< commutation control shadow register update selection disable */

/* TIMER write CHxVAL register selection */
#define TIMER_CHVSEL_ENABLE                 ((uint16_t)TIMER_CFG_CHVSEL)            /*!< write CHxVAL register selection enable */
#define TIMER_CHVSEL_DISABLE                ((uint16_t)0x0000U)                     /*!< write CHxVAL register selection disable */

/* TIMER output value selection enable */
#define TIMER_OUTSEL_ENABLE                 ((uint16_t)TIMER_CFG_OUTSEL)            /*!< output value selection enable */
#define TIMER_OUTSEL_DISABLE                ((uint16_t)0x0000U)                     /*!< output value selection disable */

/* channel additional output compare shadow enable */
#define TIMER_ADD_SHADOW_ENABLE             ((uint16_t)0x0001U)                     /*!< channel additional output shadow state enable */
#define TIMER_ADD_SHADOW_DISABLE            ((uint16_t)0x0000U)                     /*!< channel additional output shadow state disable */

/* channel output compare shadow enable */
#define TIMER_OMC_SHADOW_ENABLE             ((uint16_t)0x0008U)                     /*!< multi mode channel output shadow state enable */
#define TIMER_OMC_SHADOW_DISABLE            ((uint16_t)0x0000U)                     /*!< multi mode channel output shadow state disable */

