sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* channel output compare clear enable */
#define TIMER_OMC_CLEAR_ENABLE              ((uint16_t)0x0080U)                     /*!< multi mode channel output clear function enable */
#define TIMER_OMC_CLEAR_DISABLE             ((uint16_t)0x0000U)                     /*!< multi mode channel output clear function disable */

/* channel output compare fast enable */
#define TIMER_OMC_FAST_ENABLE               ((uint16_t)0x0004U)                     /*!< multi mode channel output compare fast function enable */
#define TIMER_OMC_FAST_DISABLE              ((uint16_t)0x0000U)                     /*!< multi mode channel output compare fast function disable */

/* channel additional output compare shadow update select */
#define TIMER_ADD_SHADOW_SELECT_UPDATE      ((uint16_t)0x0000U)                     /*!< channel additional output shadow register update by update event */
#define TIMER_ADD_SHADOW_SELECT_CMP_MATCH   ((uint16_t)0x0001U)                     /*!< channel additional output shadow register update by compare value match */

/* TIMER output value selection */
#define TIMER_PULSE_OUTPUT_NORMAL           ((uint16_t)0x0000U)                     /*!< channel output normal */
#define TIMER_PULSE_OUTPUT_CNT_UP           ((uint16_t)0x0001U)                     /*!< pulse output only when counting up */
#define TIMER_PULSE_OUTPUT_CNT_DOWN         ((uint16_t)0x0002U)                     /*!< pulse output only when counting down */
#define TIMER_PULSE_OUTPUT_CNT_BOTH         ((uint16_t)0x0003U)                     /*!< pulse output when counting up or down */
#define TIMER_PULSE_OUTPUT_MASK             ((uint16_t)0x0003U)                     /*!< pulse output mode mask */

/* multi mode channel input capture polarity */
#define TIMER_IMC_POLARITY_RISING           ((uint16_t)0x0000U)                     /*!< multi mode channel input capture rising edge */
#define TIMER_IMC_POLARITY_FALLING          ((uint16_t)0x0001U)                     /*!< multi mode channel input capture falling edge */
#define TIMER_IMC_POLARITY_BOTH_EDGE        ((uint16_t)0x0003U)                     /*!< multi mode channel input capture both edge */

/* TIMER multi mode channel mode selection */
#define TIMER_MCH_MODE_INDEPENDENTLY        ((uint16_t)0x0000U)                     /*!< multi mode channel work in independently mode */
#define TIMER_MCH_MODE_MIRRORED             ((uint16_t)0x0001U)                     /*!< multi mode channel work in mirrored output mode */
#define TIMER_MCH_MODE_COMPLEMENTARY        ((uint16_t)0x0003U)                     /*!< multi mode channel work in complementary output mode */
#define TIMER_MCH_MODE_MASK                 ((uint16_t)0x0003U)                     /*!< multi mode channel mode mask */

/* TIMER initial counter direction */
#define TIMER_INITIAL_DIRECTION_DOWN        ((uint32_t)0x00000000U)                 /*!< counter count down when synchronizaton event occurs */
#define TIMER_INITIAL_DIRECTION_UP          TIMER_CINITCTL_CINITDIR                 /*!< counter count up when synchronizaton event occurs */

/* TIMER baisc channel */
#define TIMER_BASIC_CHANNEL_0               ((uint32_t)0x00000000U)                 /*!< timer basic channel 0 */
#define TIMER_BASIC_CHANNEL_1               ((uint32_t)0x00000001U)                 /*!< timer basic channel 1 */
#define TIMER_BASIC_CHANNEL_2               ((uint32_t)0x00000002U)                 /*!< timer basic channel 2 */
#define TIMER_BASIC_CHANNEL_3               ((uint32_t)0x00000003U)                 /*!< timer basic channel 3 */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check the timer pheriph */
#define NOT_TIMER_PERIPH(timer_periph)          (((timer_periph) != TIMER0) && ((timer_periph) != TIMER1) && \
                                                ((timer_periph) != TIMER2) && ((timer_periph) != TIMER5) && \
                                                ((timer_periph) != TIMER6) && ((timer_periph) != TIMER7) && \
                                                ((timer_periph) != TIMER19) && ((timer_periph) != TIMER20) && \
                                                ((timer_periph) != TIMER60) && ((timer_periph) != TIMER61) && \
                                                ((timer_periph) != TIMER62) && ((timer_periph) != TIMER63))

/* check the psc value */
#define TIMER_PSC_LOW_VALUE                     ((uint32_t)0x00000000U)                                             /*!< minimum psc value */
#define TIMER_PSC_HIGH_VALUE                    ((uint32_t)0x0000FFFFU)                                             /*!< maximum psc value */
#define NOT_TIMER_PSC(psc)                      ((TIMER_PSC_LOW_VALUE > (psc)) || (TIMER_PSC_HIGH_VALUE < (psc)))

/* check the counter direction */
#define NOT_TIMER_COUNTERDIRECTION(direction)   (((direction) != TIMER_COUNTER_UP) && ((direction) != TIMER_COUNTER_DOWN))

/* check the timer aligned */
#define NOT_TIMER_ALIGNED(aligned)              (((aligned) != TIMER_COUNTER_EDGE) && ((aligned) != TIMER_COUNTER_CENTER_DOWN) && \
                                                ((aligned) != TIMER_COUNTER_CENTER_UP) && ((aligned) != TIMER_COUNTER_CENTER_BOTH))

/* check the period value */
#define PERIOD_LOW_VALUE                        ((uint32_t)0x00000000U)                                             /*!< minimum period value */
#define PERIOD_HIGH_VALUE                       ((uint32_t)0x0000FFFFU)                                             /*!< maximum period value */
#define NOT_TIMER_PERIOD(period)                ((PERIOD_LOW_VALUE > (period)) || (PERIOD_HIGH_VALUE < (period)))

/* check the clock division */
#define NOT_TIMER_CLOCKDIVISION(clockdivision)  (((clockdivision) != TIMER_CKDIV_DIV1) && ((clockdivision) != TIMER_CKDIV_DIV2) && \
                                                ((clockdivision) != TIMER_CKDIV_DIV4))

/* check the psc value */
#define REPETITIONCOUNTER_LOW_VALUE                     ((uint8_t)0x00000000U)                                      /*!< minimum repetitioncounter value */
#define REPETITIONCOUNTER_HIGH_VALUE                    ((uint8_t)0x000000FFU)                                      /*!< maximum repetitioncounter value */
#define NOT_TIMER_REPETITIONCOUNTER(repetitioncounter)  ((REPETITIONCOUNTER_LOW_VALUE > (repetitioncounter)) || (REPETITIONCOUNTER_HIGH_VALUE < (repetitioncounter)))

/* check the pscreload */
#define NOT_TIMER_PSCRELOAD(pscreload)                  (((pscreload) != TIMER_PSC_RELOAD_NOW) && ((pscreload) != TIMER_PSC_RELOAD_UPDATE))

/* check the counter value */
#define TIMER_COUNTER_LOW_VALUE                         ((uint16_t)0x00000000U)                                     /*!< minimum counter value */
#define TIMER_COUNTER_HIGH_VALUE                        ((uint16_t)0x0000FFFFU)                                     /*!< maximum psc value */
#define NOT_TIMER_COUNTER(counter)                      ((TIMER_COUNTER_LOW_VALUE > (counter)) || (TIMER_COUNTER_HIGH_VALUE < (counter)))

/* check the single pulse mode */
#define NOT_TIMER_SPMODE(spmode)                        (((spmode) != TIMER_SP_MODE_SINGLE) && ((spmode) != TIMER_SP_MODE_REPETITIVE))

/* check the timer update */
#define NOT_TIMER_UPDATE(update)                        (((update) != TIMER_UPDATE_SRC_REGULAR) && ((update) != TIMER_UPDATE_SRC_GLOBAL))

