sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* check the timer newvalue */
#define NOT_TIMER_NEWVALUE(newvalue)                    (((newvalue) != ENABLE)  && ((newvalue) != DISABLE))

/* check the channel control shadow register update control */
#define NOT_TIMER_CCUCTL(ccuctl)                        (((ccuctl) != TIMER_UPDATECTL_CCU) && ((ccuctl) != TIMER_UPDATECTL_CCUTRI))

/* check the timer dma */
#define NOT_TIMER_DMA(dma)                              (((dma) != TIMER_DMA_UPD) && ((dma) != TIMER_DMA_CH0D) && \
                                                        ((dma) != TIMER_DMA_CH1D) && ((dma) != TIMER_DMA_CH2D) && \
                                                        ((dma) != TIMER_DMA_CH3D) && ((dma) != TIMER_DMA_CMTD) && \
                                                        ((dma) != TIMER_DMA_TRGD) && ((dma) != TIMER_DMA_MCH0D) && \
                                                        ((dma) != TIMER_DMA_MCH1D) && ((dma) != TIMER_DMA_MCH2D) && \
                                                        ((dma) != TIMER_DMA_MCH3D))

/* check the dma request */
#define NOT_TIMER_DMA_REQUEST(dma_request)              (((dma_request) != TIMER_DMAREQUEST_UPDATEEVENT) && ((dma_request) != TIMER_DMAREQUEST_CHANNELEVENT))

/* check the dma baseaddr */
#define NOT_TIMER_DMA_BASEADDR(dma_baseaddr)            (((dma_baseaddr) != TIMER_DMACFG_DMATA_CTL0) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CTL1) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_SMCFG) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_DMAINTEN) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_INTF) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_SWEVG) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_CHCTL0) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CHCTL1) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_CHCTL2) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CNT) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_PSC) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CAR) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_CREP) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH0CV) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH1CV) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH2CV) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH3CV) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CCHP) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCHCTL0) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCHCTL1) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCHCTL2) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCH0CV) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCH1CV) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCH2CV) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCH3CV) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH0CV_ADD) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH1CV_ADD) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH2CV_ADD) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH3CV_ADD) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CTL2) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_BRKCFG) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_FCCHP0) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_FCCHP1) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_FCCHP2) && \
                                                        ((dma_baseaddr) != TIMER_DMACFG_DMATA_FCCHP3))

/* check the dma length */
#define NOT_TIMER_DMA_LENGTH(dma_lenth)                 ((((uint32_t)((dma_lenth) >> 0x8U)) > (uint32_t)0x00000022U) || (((dma_lenth) & 0xFFFFC0FFU) != 0x00000000U))

/* check the event source */
#define NOT_TIMER_EVENT_SRC(event)                      (((event) != TIMER_EVENT_SRC_UPG) && ((event) != TIMER_EVENT_SRC_CH0G) && \
                                                        ((event) != TIMER_EVENT_SRC_CH1G) && ((event) != TIMER_EVENT_SRC_CH2G) && \
                                                        ((event) != TIMER_EVENT_SRC_CH3G) && ((event) != TIMER_EVENT_SRC_CMTG) && \
                                                        ((event) != TIMER_EVENT_SRC_TRGG) && ((event) != TIMER_EVENT_SRC_BRKG) && \
                                                        ((event) != TIMER_EVENT_SRC_MCH0G) && ((event) != TIMER_EVENT_SRC_MCH1G) && \
                                                        ((event) != TIMER_EVENT_SRC_MCH2G) && ((event) != TIMER_EVENT_SRC_MCH3G) && \
                                                        ((event) != TIMER_EVENT_SRC_MCH0COMADDG) && ((event) != TIMER_EVENT_SRC_MCH1COMADDG) && \
                                                        ((event) != TIMER_EVENT_SRC_MCH2COMADDG) && ((event) != TIMER_EVENT_SRC_MCH3COMADDG) && \
                                                        ((event) != TIMER_EVENT_SRC_CH0COMADDG) && ((event) != TIMER_EVENT_SRC_CH1COMADDG) && \
                                                        ((event) != TIMER_EVENT_SRC_CH2COMADDG) && ((event) != TIMER_EVENT_SRC_CH3COMADDG))

/* check the run off state */
#define NOT_TIMER_BREAK_RUNOFFSTATE(runoffstate)        (((runoffstate) != TIMER_ROS_STATE_ENABLE) && ((runoffstate) != TIMER_ROS_STATE_DISABLE))

/* check the idel off state */
#define NOT_TIMER_BREAK_IDELOFFSTATE(ideloffstate)      (((ideloffstate) != TIMER_IOS_STATE_ENABLE) && ((ideloffstate) != TIMER_IOS_STATE_DISABLE))

/* check the output state */
#define NOT_TIMER_OUTPUTSTATE(outputstate)              (((outputstate) != TIMER_CCX_ENABLE) && ((outputstate) != TIMER_CCX_DISABLE))

/* check the deadtime value */
#define TIMER_DEADTIME_HIGH_VALUE                       ((uint32_t)0x0000000FFU)                                        /*!< maximum deadtime value */
#define NOT_TIMER_BREAK_DEADTIME(deadtime)              (TIMER_DEADTIME_HIGH_VALUE < (deadtime))

/* check the break polarity */
#define NOT_TIMER_BREAK_POLARITY(breakpolarity)         (((breakpolarity) != TIMER_BREAK_POLARITY_LOW) && ((breakpolarity) != TIMER_BREAK_POLARITY_HIGH))

/* check the output auto state */
#define NOT_TIMER_BREAK_OUTPUTAUTOSTATE(outputautostate) (((outputautostate) != TIMER_OUTAUTO_ENABLE)  && ((outputautostate) != TIMER_OUTAUTO_DISABLE))

