sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* check the protect mode */
#define NOT_TIMER_BREAK_PROTECTMODE(protectmode)         (((protectmode) != TIMER_CCHP_PROT_OFF) && ((protectmode) != TIMER_CCHP_PROT_0) && \
                                                         ((protectmode) != TIMER_CCHP_PROT_1) && ((protectmode) != TIMER_CCHP_PROT_2))

/* check the break state */
#define NOT_TIMER_BREAK_BREAKSTATE(breakstate)           (((breakstate) != TIMER_BREAK_ENABLE) && ((breakstate) != TIMER_BREAK_DISABLE))

/* check the deadtime shadow enable */
#define NOT_TIMER_BREAK_DTSHADOW(dtshadow)               (((dtshadow) != TIMER_DEADTIME_SHADOW_ENABLE) && ((dtshadow) != TIMER_DEADTIME_SHADOW_DISABLE))

/* check the outputnstate */
#define NOT_TIMER_OUTPUTNSTATE(outputnstate)             (((outputnstate) != TIMER_CCXN_ENABLE) && ((outputnstate) != TIMER_CCXN_DISABLE))

/* check the output polarity */
#define NOT_TIMER_OCPOLARITY(ocpolarity)                 (((ocpolarity) != TIMER_OC_POLARITY_HIGH) && ((ocpolarity) != TIMER_OC_POLARITY_LOW))

/* check the output polarity */
#define NOT_TIMER_OCNPOLARITY(ocnpolarity)               (((ocnpolarity) != TIMER_OCN_POLARITY_HIGH) && ((ocnpolarity) != TIMER_OCN_POLARITY_LOW))

/* check the output idle state */
#define NOT_TIMER_OCIDLESTATE(ocidlestate)               (((ocidlestate) != TIMER_OC_IDLE_STATE_HIGH) && ((ocidlestate) != TIMER_OC_IDLE_STATE_LOW))

/* check the output idle state */
#define NOT_TIMER_OCNIDLESTATE(ocnidlestate)             (((ocnidlestate) != TIMER_OCN_IDLE_STATE_HIGH) && ((ocnidlestate) != TIMER_OCN_IDLE_STATE_LOW))

/* check the timer channel */
#define NOT_TIMER_CHANNEL(channel)                       (((channel) != TIMER_CH_0) && ((channel) != TIMER_CH_1) && \
                                                         ((channel) != TIMER_CH_2) && ((channel) != TIMER_CH_3))

/* check the timer all channel */
#define NOT_TIMER_ALL_CHANNEL(all_channel)               (((all_channel) != TIMER_CH_0) && ((all_channel) != TIMER_CH_1) && \
                                                         ((all_channel) != TIMER_CH_2) && ((all_channel) != TIMER_CH_3) && \
                                                         ((all_channel) != TIMER_MCH_0) && ((all_channel) != TIMER_MCH_1) && \
                                                         ((all_channel) != TIMER_MCH_2) && ((all_channel) != TIMER_MCH_3))
                                                         
/* check the output control mode */                      
#define NOT_TIMER_OCMODE(ocmode)                         (((ocmode) != TIMER_OC_MODE_TIMING) && ((ocmode) != TIMER_OC_MODE_ACTIVE) && \
                                                         ((ocmode) != TIMER_OC_MODE_INACTIVE) && ((ocmode) != TIMER_OC_MODE_TOGGLE) && \
                                                         ((ocmode) != TIMER_OC_MODE_LOW) && ((ocmode) != TIMER_OC_MODE_HIGH) && \
                                                         ((ocmode) != TIMER_OC_MODE_PWM0) && ((ocmode) != TIMER_OC_MODE_PWM1) && \
                                                         ((ocmode) != TIMER_OC_MODE_CMP_PWM0) && ((ocmode) != TIMER_OC_MODE_CMP_PWM1) && \
                                                         ((ocmode) != TIMER_OC_MODE_ASYM_PWM0) && ((ocmode) != TIMER_OC_MODE_ASYM_PWM1))
                                              

/* check the compare value */
#define TIMER_CHANNEL_COMPARE_LOW_VALUE                  ((uint32_t)0x00000000U)                                            /*!< minimum compare value */
#define TIMER_CHANNEL_COMPARE_HIGH_VALUE                 ((uint32_t)0x00000FFFFU)                                           /*!< maximum compare value */
#define NOT_TIMER_CHANNEL_COMPARE_VALUE(pulse)           ((TIMER_CHANNEL_COMPARE_LOW_VALUE > (pulse)) || (TIMER_CHANNEL_COMPARE_HIGH_VALUE < (pulse)))

/* check the ouput shadow */
#define NOT_TIMER_OCSHADOW(ocshadow)                     (((ocshadow) != TIMER_OC_SHADOW_ENABLE) && ((ocshadow) != TIMER_OC_SHADOW_DISABLE) && \
                                                         ((ocshadow) != TIMER_OMC_SHADOW_ENABLE) && ((ocshadow) != TIMER_OMC_SHADOW_DISABLE))

/* check the ouput clear */
#define NOT_TIMER_OCCLEAR(occlear)                       (((occlear) != TIMER_OC_CLEAR_ENABLE) && ((occlear) != TIMER_OC_CLEAR_DISABLE) && \
                                                         ((occlear) != TIMER_OMC_CLEAR_ENABLE) && ((occlear) != TIMER_OMC_CLEAR_DISABLE))

/* check the ouput fast */
#define NOT_TIMER_OCFAST(ocfast)                         (((ocfast) != TIMER_OC_FAST_ENABLE) && ((ocfast) != TIMER_OC_FAST_DISABLE) && \
                                                         ((ocfast) != TIMER_OMC_FAST_ENABLE)  && ((ocfast) != TIMER_OMC_FAST_DISABLE))

/* check the ouput polarity */
#define NOT_TIMER_CHANNEL_OCPOLARITY(ocpolarity)         (((ocpolarity) != TIMER_OC_POLARITY_HIGH) && ((ocpolarity) != TIMER_OC_POLARITY_LOW) && \
                                                         ((ocpolarity) != TIMER_OMC_POLARITY_HIGH) && ((ocpolarity) != TIMER_OMC_POLARITY_LOW))

/* check the channel state */
#define NOT_TIMER_CHANNEL_STATE(state)                   (((state) != TIMER_CCX_ENABLE) && ((state) != TIMER_CCX_DISABLE) && \
                                                         ((state) != TIMER_MCCX_ENABLE) && ((state) != TIMER_MCCX_DISABLE))

/* check the input polarity */
#define NOT_TIMER_ICPOLARITY(icpolarity)                 (((icpolarity) != TIMER_IC_POLARITY_RISING) && ((icpolarity) != TIMER_IC_POLARITY_FALLING) && \
                                                         ((icpolarity) != TIMER_IC_POLARITY_BOTH_EDGE))

/* check the input selection */
#define NOT_TIMER_ICSELECTION(icselection)               (((icselection) != TIMER_IC_SELECTION_DIRECTTI) && ((icselection) != TIMER_IC_SELECTION_INDIRECTTI) && \
                                                         ((icselection) != TIMER_IC_SELECTION_ITS) && ((icselection) != TIMER_IC_SELECTION_PAIR))

/* check the input prescaler */
#define NOT_TIMER_ICPRESCALER(icprescaler)               (((icprescaler) != TIMER_IC_PSC_DIV1) && ((icprescaler) != TIMER_IC_PSC_DIV2) && \
                                                         ((icprescaler) != TIMER_IC_PSC_DIV4) && ((icprescaler) != TIMER_IC_PSC_DIV8))

/* check the filter value */
#define TIMER_CHANNEL_ICFILTER_HIGH_VALUE                ((uint32_t)0x0000000FU)                                                /*!< maximum filter value */
#define NOT_TIMER_CHANNEL_CHANNEL_ICFILTER(icfilter)     (TIMER_CHANNEL_ICFILTER_HIGH_VALUE < (icfilter))

/* check the buffer level */
#define NOT_TIMER_IC_MULTI_BUFF_LEVEL(buffer_level)      (((buffer_level) != TIMER_IC_MULTI_BUFF_LEVEL_1) && ((buffer_level) != TIMER_IC_MULTI_BUFF_LEVEL_2) && \
                                                         ((buffer_level) != TIMER_IC_MULTI_BUFF_LEVEL_3) && ((buffer_level) != TIMER_IC_MULTI_BUFF_LEVEL_4))

/* check the multi channel polarity */
#define NOT_TIMER_IC_MULTI_POLARITY(icpolarity)          (((icpolarity) != TIMER_IC_MULTI_POLARITY_RISING) && ((icpolarity) != TIMER_IC_MULTI_POLARITY_FALLING) && \
                                                         ((icpolarity) != TIMER_IC_MULTI_POLARITY_BOTH_EDGE))

/* check the multi channel polarity */
#define NOT_TIMER_HALL_MODE(hallmode)                    (((hallmode) != TIMER_HALLINTERFACE_ENABLE) && ((hallmode) != TIMER_HALLINTERFACE_DISABLE))

/* check the multi channel output mode */
#define NOT_TIMER_MULTI_MODE_CHANNEL_OUTPUT_MODE(outputmode)    (((outputmode) != TIMER_MCH_MODE_INDEPENDENTLY) && ((outputmode) != TIMER_MCH_MODE_MIRRORED) && \
                                                                ((outputmode) != TIMER_MCH_MODE_COMPLEMENTARY) && ((outputmode) != TIMER_MCH_MODE_MASK))

/* check the multi channel output state */
#define NOT_TIMER_MULTI_MODE_CHANNEL_OUTPUT_STATE(outputstate)  (((outputstate) != TIMER_MCCX_ENABLE) && ((outputstate) != TIMER_MCCX_DISABLE))

/* check the multi channel output polarity */
#define NOT_TIMER_MULTI_MODE_CHANNEL_OCPOLARITY(ocpolarity)     (((ocpolarity) != TIMER_OMC_POLARITY_HIGH) && ((ocpolarity) != TIMER_OMC_POLARITY_LOW))

/* check the multi channel */
#define NOT_TIMER_MULTI_CHANNEL(channel)                        (((channel) != TIMER_MCH_0) && ((channel) != TIMER_MCH_1) && \
                                                                ((channel) != TIMER_MCH_2) && ((channel) != TIMER_MCH_3))

/* check the multi channel mode selection */
#define NOT_TIMER_MULTI_CHANNEL_MODE_SELECTION(multi_mode_sel)  (((multi_mode_sel) != TIMER_MCH_MODE_INDEPENDENTLY) && ((multi_mode_sel) != TIMER_MCH_MODE_MIRRORED) && \
                                                                ((multi_mode_sel) != TIMER_MCH_MODE_COMPLEMENTARY))

/* check the multi channel input trigger */
#define NOT_TIMER_INPUT_TRIGGER_SOURCE(intrigger)               (((intrigger) != TIMER_SMCFG_TRGSEL_NONE) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI0) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ITI1) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI2) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ITI3) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI4) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ITI5) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI6) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ITI7) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI8) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ITI9) && ((intrigger) != TIMER_SMCFG_TRGSEL_CI0F_ED) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_CI0FE0) && ((intrigger) != TIMER_SMCFG_TRGSEL_CI1FE1) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ETIFP) && ((intrigger) != TIMER_SMCFG_TRGSEL_CI2FE2) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_CI3FE3) && ((intrigger) != TIMER_SMCFG_TRGSEL_MCI0FEM0) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_MCI1FEM1) && ((intrigger) != TIMER_SMCFG_TRGSEL_MCI2FEM2) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_MCI3FEM3))

/* check the multi channel output trigger */
#define NOT_TIMER_OUTPUT_TRIGGER_SOURCE(outtrigger)             (((outtrigger) != TIMER_TRI_OUT_SRC_RESET) && ((outtrigger) != TIMER_TRI_OUT_SRC_ENABLE) && \
                                                                ((outtrigger) != TIMER_TRI_OUT_SRC_UPDATE) && ((outtrigger) != TIMER_TRI_OUT_SRC_CH0) && \
                                                                ((outtrigger) != TIMER_TRI_OUT_SRC_O0CPRE) && ((outtrigger) != TIMER_TRI_OUT_SRC_O1CPRE) && \
                                                                ((outtrigger) != TIMER_TRI_OUT_SRC_O2CPRE) && ((outtrigger) != TIMER_TRI_OUT_SRC_O3CPRE) && \
                                                                ((outtrigger) != TIMER_TRI_OUT_SRC_OVERFLOW) && ((outtrigger) != TIMER_TRI_OUT_SRC_UNDERFLOW) && \
                                                                ((outtrigger) != TIMER_TRI_OUT_SRC_SWEVENT))

/* check the slave mode */
#define NOT_TIMER_SLAVE_MODE_SELECT(slavemode)                  (((slavemode) != TIMER_QUAD_DECODER_MODE0) && ((slavemode) != TIMER_QUAD_DECODER_MODE1) && \
                                                                ((slavemode) != TIMER_QUAD_DECODER_MODE2) && ((slavemode) != TIMER_SLAVE_MODE_RESTART) && \
                                                                ((slavemode) != TIMER_SLAVE_MODE_PAUSE) && ((slavemode) != TIMER_SLAVE_MODE_EVENT) && \
                                                                ((slavemode) != TIMER_SLAVE_MODE_EXTERNAL0) && ((slavemode) != TIMER_SLAVE_MODE_RESTART_EVENT) && \
                                                                ((slavemode) != TIMER_DECODER_MODE0) && ((slavemode) != TIMER_DECODER_MODE1) && \
                                                                ((slavemode) != TIMER_DECODER_MODE2) && ((slavemode) != TIMER_DECODER_MODE3) && \
                                                                ((slavemode) != TIMER_SLAVE_MODE_DISABLE))

/* check the master slave mode */
#define NOT_TIMER_MASTER_SLAVE_MODE(masterslave)                (((masterslave) != TIMER_MASTER_SLAVE_MODE_ENABLE) && ((masterslave) != TIMER_MASTER_SLAVE_MODE_DISABLE))

/* check the external trigger */
#define NOT_TIMER_EXTERNAL_TRIGGER(ext_trg)                     (((ext_trg) != TIMER_EXTERNAL_TRIGGER_0) && ((ext_trg) != TIMER_EXTERNAL_TRIGGER_1) && \
                                                                ((ext_trg) != TIMER_EXTERNAL_TRIGGER_2))

/* check the external trigger prescaler */
#define NOT_TIMER_EXT_TRI_PSC(extprescaler)                     (((extprescaler) != TIMER_EXT_TRI_PSC_OFF) && ((extprescaler) != TIMER_EXT_TRI_PSC_DIV2) && \
                                                                ((extprescaler) != TIMER_EXT_TRI_PSC_DIV4) && ((extprescaler) != TIMER_EXT_TRI_PSC_DIV8))

/* check the external polarity */
#define NOT_TIMER_EXTPOLARITY(extpolarity)                      (((extpolarity) != TIMER_ETP_FALLING) && ((extpolarity) != TIMER_ETP_RISING))

/* check the filter value */
#define TIMER_CHANNEL_EXTFILTER_HIGH_VALUE                      ((uint32_t)0x0000000FU)                                     /*!< maximum filter value */
#define NOT_TIMER_CHANNEL_EXTFILTER(extfilter)                  (TIMER_CHANNEL_EXTFILTER_HIGH_VALUE < (extfilter))

