sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* check the decoder */
#define NOT_TIMER_QUAD_DECODER(decomode)                        (((decomode) != TIMER_QUAD_DECODER_MODE0) && ((decomode) != TIMER_QUAD_DECODER_MODE1) && \
                                                                ((decomode) != TIMER_QUAD_DECODER_MODE2))

/* check the watchdog value */
#define TIMER_WATCHDOG_LOW_VALUE                                ((uint32_t)0x00000000U)                                     /*!< minimum watch value */
#define TIMER_WATCHDOG_HIGH_VALUE                               ((uint32_t)0xFFFFFFFFU)                                     /*!< maximum watch value */
#define NOT_TIMER_WATCHDOG_VALUE(value)                         ((TIMER_WATCHDOG_LOW_VALUE > (value)) || (TIMER_WATCHDOG_HIGH_VALUE < (value)))

/* check the input trigger */
#define NOT_TIMER_INTRIGGER(intrigger)                          (((intrigger) != TIMER_SMCFG_TRGSEL_ITI0) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI1) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ITI2) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI3) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ITI4) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI5) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ITI6) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI7) && \
                                                                ((intrigger) != TIMER_SMCFG_TRGSEL_ITI8) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI9))

/* check the external trigger */
#define NOT_TIMER_EXTRIGGER(extrigger)                          (((extrigger) != TIMER_SMCFG_TRGSEL_CI0F_ED) && ((extrigger) != TIMER_SMCFG_TRGSEL_CI0FE0) && \
                                                                ((extrigger) != TIMER_SMCFG_TRGSEL_CI1FE1))

/* check the timer remap */
#define NOT_TIMER_REMAP(remap)                                  (((remap) != TIMER_CI0_RMP_GPIO) && ((remap) != TIMER_CI0_RMP_LXTAL) && \
                                                                ((remap) != TIMER_CI0_RMP_HXTAL) && ((remap) != TIMER_CI0_RMP_CKOUT0SEL))

/* check the timer ccsel */
#define NOT_TIMER_CCSEL(ccsel)                                  (((ccsel) != TIMER_CHVSEL_DISABLE) && ((ccsel) != TIMER_CHVSEL_ENABLE))

/* check the timer outsel */
#define NOT_TIMER_OUTSEL(outsel)                                (((outsel) != TIMER_OUTSEL_DISABLE) && ((outsel) != TIMER_OUTSEL_ENABLE))

/* check the timer ccusel */
#define NOT_TIMER_CCUSEL(ccusel)                                (((ccusel) != TIMER_CCUSEL_DISABLE) && ((ccusel) != TIMER_CCUSEL_ENABLE))

/* check the timer rdsel */
#define NOT_TIMER_RDSEL(rdsel)                                  (((rdsel) != TIMER_RDSEL_DISABLE) && ((rdsel) != TIMER_RDSEL_ENABLE))

/* check the timer pulsesel */
#define NOT_TIMER_PLUSE_OUTPUT(pulsesel)                        (((pulsesel) != TIMER_PULSE_OUTPUT_NORMAL) && ((pulsesel) != TIMER_PULSE_OUTPUT_CNT_UP) && \
                                                                ((pulsesel) != TIMER_PULSE_OUTPUT_CNT_DOWN) && ((pulsesel) != TIMER_PULSE_OUTPUT_CNT_BOTH))

/* check the timer pwmasymode */
#define NOT_TIMER_PWMASYMODE(pwmasymode)                        (((pwmasymode) != TIMER_OC_MODE_ASYM_PWM0) && ((pwmasymode) != TIMER_OC_MODE_ASYM_PWM1))

/* check the timer pwmasymode direction */
#define NOT_TIMER_PWMASYMODE_DIR(dir)                           (((dir) != TIMER_CTL0_CAM_CENTER_DOWN) && ((dir) != TIMER_CTL0_CAM_CENTER_UP) && ((dir) != TIMER_CTL0_CAM_CENTER_BOTH))

/* check the compare value */
#define TIMER_COMPARE_LOW_VALUE                                 ((uint16_t)0x00000000U)                                                       /*!< minimum compare value */
#define TIMER_COMPARE_HIGH_VALUE                                ((uint16_t)0x0000FFFFU)                                                       /*!< maximum compare value */
#define NOT_TIMER_COMPARE_VALUE(value)                          ((TIMER_COMPARE_LOW_VALUE > (value)) || (TIMER_COMPARE_HIGH_VALUE < (value)))

/* check the aocshadow */
#define NOT_TIMER_ADD_SHADOW(aocshadow)                         (((aocshadow) != TIMER_ADD_SHADOW_ENABLE) && ((aocshadow) != TIMER_ADD_SHADOW_DISABLE))

/* check the shadow select */
#define NOT_TIMER_ADD_SHADOW_SELECT(update)                     (((update) != TIMER_ADD_SHADOW_SELECT_UPDATE) && ((update) != TIMER_ADD_SHADOW_SELECT_CMP_MATCH))

/* check the filter value */
#define TIMER_BREAK_FILTER_HIGH_VALUE                           ((uint32_t)0x0000000FU)        /*!< maximum filter value */
#define NOT_TIMER_BREAK_FILTERE_VALUE(filter)                   (TIMER_BREAK_FILTER_HIGH_VALUE < (filter))

/* check the break input */
#define NOT_TIMER_BREAKINPUT(break_input)                       (((break_input) != TIMER_BREAKINPUT_BRK0) && ((break_input) != TIMER_BREAKINPUT_BRK1) && \
                                                                ((break_input) != TIMER_BREAKINPUT_BRK2) && ((break_input) != TIMER_BREAKINPUT_BRK3))

/* check the break input polarity */
#define NOT_TIMER_BRKIN_POLARITY(break_input)                   (((break_input) != TIMER_BRKIN_POLARITY_HIGH) && ((break_input) != TIMER_BRKIN_POLARITY_LOW))

/* check the freecomstate */
#define NOT_TIMER_FREECOMSTATE(freecomstate)                    (((freecomstate) != TIMER_FCCHP_STATE_DISABLE) && ((freecomstate) != TIMER_FCCHP_STATE_ENABLE))

/* check the run off state */
#define NOT_TIMER_RUNOFFSTATE(runoffstate)                      (((runoffstate) != TIMER_ROS_STATE_DISABLE) && ((runoffstate) != TIMER_ROS_STATE_ENABLE))

/* check the idel off state */
#define NOT_TIMER_IDELOFFSTATE(ideloffstate)                    (((ideloffstate) != TIMER_IOS_STATE_DISABLE) && ((ideloffstate) != TIMER_IOS_STATE_ENABLE))

/* check the counter value */
#define TIMER_INITIAL_COUNTER_HIGH_VALUE                       ((uint32_t)0x00000FFFFU)                                                     /*!< maximum counter value */
#define NOT_TIMER_INITIAL_COUNTER_VALUE(value)                 (TIMER_INITIAL_COUNTER_HIGH_VALUE < (value))

/* check the initial direction */
#define NOT_TIMER_INITIAL_DIRECTION(direction)                 (((direction) != TIMER_INITIAL_DIRECTION_DOWN) && ((direction) != TIMER_INITIAL_DIRECTION_UP))

/* check the basic timer */
#define NOT_BASIC_TIMER_PERIPH(timer_periph)                   (((timer_periph) != TIMER5) && ((timer_periph) != TIMER6))

