sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* check the basic timer channel */
#define NOT_TIMER_BAISC_CHANNEL(channel)                       (((channel) != TIMER_BASIC_CHANNEL_0) && ((channel) != TIMER_BASIC_CHANNEL_1) && \
                                                               ((channel) != TIMER_BASIC_CHANNEL_2) && ((channel) != TIMER_BASIC_CHANNEL_3))

/* check the period value */
#define BASIC_PERIOD_LOW_VALUE                                 ((uint32_t)0x00000000U)                                                      /*!< minimum period value */
#define BASIC_PERIOD_HIGH_VALUE                                ((uint32_t)0xFFFFFFFFU)                                                      /*!< maximum period value */
#define NOT_BASIC_TIMER_PERIOD(period)                         ((BASIC_PERIOD_LOW_VALUE > (period)) || (BASIC_PERIOD_HIGH_VALUE < (period)))

/* check the basic timer dma */
#define NOT_BASIC_TIMER_DMA(dma)                               (((dma) != TIMER_DMA_UPD0) && ((dma) != TIMER_DMA_UPD1) && \
                                                               ((dma) != TIMER_DMA_UPD2) && ((dma) != TIMER_DMA_UPD3))

/* check the basic timer event */
#define NOT_BASIC_TIMER_EVENT(event)                           (((event) != TIMER_EVENT_SRC_UPG0) && ((event) != TIMER_EVENT_SRC_UPG1) && \
                                                               ((event) != TIMER_EVENT_SRC_UPG2) && ((event) != TIMER_EVENT_SRC_UPG3))

/* check the basic timer output trigger */
#define NOT_BASIC_TIMER_OUTTRIGGER(outtrigger)                 (((outtrigger) != TIMER_TRI_OUT_SRC_RESET)  && ((outtrigger) != TIMER_TRI_OUT_SRC_ENABLE) && \
                                                               ((outtrigger) != TIMER_TRI_OUT_SRC_UPDATE))

/* check the timer flag */
#define NOT_TIMER_FLAG(flag)                                   (((flag) != TIMER_FLAG_UP)        && ((flag) != TIMER_FLAG_CH0) && \
                                                               ((flag) != TIMER_FLAG_CH1)        && ((flag) != TIMER_FLAG_CH2) && \
                                                               ((flag) != TIMER_FLAG_CH3)        && ((flag) != TIMER_FLAG_CMT) && \
                                                               ((flag) != TIMER_FLAG_TRG)        && ((flag) != TIMER_FLAG_BRK) && \
                                                               ((flag) != TIMER_FLAG_CH0O)       && ((flag) != TIMER_FLAG_CH1O) && \
                                                               ((flag) != TIMER_FLAG_CH2O)       && ((flag) != TIMER_FLAG_CH3O) && \
                                                               ((flag) != TIMER_FLAG_SYSB)       && ((flag) != TIMER_FLAG_DECJ) && \
                                                               ((flag) != TIMER_FLAG_DECDIS)     && ((flag) != TIMER_FLAG_MCH0) && \
                                                               ((flag) != TIMER_FLAG_MCH1)       && ((flag) != TIMER_FLAG_MCH2) && \
                                                               ((flag) != TIMER_FLAG_MCH3)       && ((flag) != TIMER_FLAG_MCH0O) && \
                                                               ((flag) != TIMER_FLAG_MCH1O)      && ((flag) != TIMER_FLAG_MCH2O) && \
                                                               ((flag) != TIMER_FLAG_MCH3O)      && ((flag) != TIMER_FLAG_CH0COMADD) && \
                                                               ((flag) != TIMER_FLAG_CH1COMADD)  && ((flag) != TIMER_FLAG_CH2COMADD) && \
                                                               ((flag) != TIMER_FLAG_CH3COMADD)  && ((flag) != TIMER_FLAG_MCH0COMADD) && \
                                                               ((flag) != TIMER_FLAG_MCH1COMADD) && ((flag) != TIMER_FLAG_MCH2COMADD) && \
                                                               ((flag) != TIMER_FLAG_MCH3COMADD) && ((flag) != TIMER_FLAG_UP0) && \
                                                               ((flag) != TIMER_FLAG_UP1)        && ((flag) != TIMER_FLAG_UP2) && \
                                                               ((flag) != TIMER_FLAG_UP3))

/* check the timer interrupt */
#define NOT_TIMER_INTERRUPT_FLAG(interrupt)                    (((interrupt) != TIMER_INT_UP)        && ((interrupt) != TIMER_INT_CH0) && \
                                                               ((interrupt) != TIMER_INT_CH1)        && ((interrupt) != TIMER_INT_CH2) && \
                                                               ((interrupt) != TIMER_INT_CH3)        && ((interrupt) != TIMER_INT_CMT) && \
                                                               ((interrupt) != TIMER_INT_TRG)        && ((interrupt) != TIMER_INT_BRK) && \
                                                               ((interrupt) != TIMER_INT_DECJ)       && ((interrupt) != TIMER_INT_DECDIS) && \
                                                               ((interrupt) != TIMER_INT_MCH0)       && ((interrupt) != TIMER_INT_MCH1) && \
                                                               ((interrupt) != TIMER_INT_MCH2)       && ((interrupt) != TIMER_INT_MCH3) && \
                                                               ((interrupt) != TIMER_INT_CH0COMADD)  && ((interrupt) != TIMER_INT_CH1COMADD) && \
                                                               ((interrupt) != TIMER_INT_CH2COMADD)  && ((interrupt) != TIMER_INT_CH3COMADD) && \
                                                               ((interrupt) != TIMER_INT_MCH0COMADD) && ((interrupt) != TIMER_INT_MCH1COMADD) && \
                                                               ((interrupt) != TIMER_INT_MCH2COMADD) && ((interrupt) != TIMER_INT_MCH3COMADD) && \
                                                               ((interrupt) != TIMER_INT_UP0)        && ((interrupt) != TIMER_INT_UP1) && \
                                                               ((interrupt) != TIMER_INT_UP2)        && ((interrupt) != TIMER_INT_UP3))

/* check the timer interrupt flag */
#define NOT_TIMER_INT_FLAG(int_flag)                           (((int_flag) != TIMER_INT_FLAG_UP)        && ((int_flag) != TIMER_INT_FLAG_CH0) && \
                                                               ((int_flag) != TIMER_INT_FLAG_CH1)        && ((int_flag) != TIMER_INT_FLAG_CH2) && \
                                                               ((int_flag) != TIMER_INT_FLAG_CH3)        && ((int_flag) != TIMER_INT_FLAG_CMT) && \
                                                               ((int_flag) != TIMER_INT_FLAG_TRG)        && ((int_flag) != TIMER_INT_FLAG_BRK) && \
                                                               ((int_flag) != TIMER_INT_FLAG_CH0O)       && ((int_flag) != TIMER_INT_FLAG_CH1O) && \
                                                               ((int_flag) != TIMER_INT_FLAG_CH2O)       && ((int_flag) != TIMER_INT_FLAG_CH3O) && \
                                                               ((int_flag) != TIMER_INT_FLAG_SYSB)       && ((int_flag) != TIMER_INT_FLAG_DECJ) && \
                                                               ((int_flag) != TIMER_INT_FLAG_DECDIS)     && ((int_flag) != TIMER_INT_FLAG_MCH0) && \
                                                               ((int_flag) != TIMER_INT_FLAG_MCH1)       && ((int_flag) != TIMER_INT_FLAG_MCH2) && \
                                                               ((int_flag) != TIMER_INT_FLAG_MCH3)       && ((int_flag) != TIMER_INT_FLAG_MCH0O) && \
                                                               ((int_flag) != TIMER_INT_FLAG_MCH1O)      && ((int_flag) != TIMER_INT_FLAG_MCH2O) && \
                                                               ((int_flag) != TIMER_INT_FLAG_MCH3O)      && ((int_flag) != TIMER_INT_FLAG_CH0COMADD) && \
                                                               ((int_flag) != TIMER_INT_FLAG_CH1COMADD)  && ((int_flag) != TIMER_INT_FLAG_CH2COMADD) && \
                                                               ((int_flag) != TIMER_INT_FLAG_CH3COMADD)  && ((int_flag) != TIMER_INT_FLAG_MCH0COMADD) && \
                                                               ((int_flag) != TIMER_INT_FLAG_MCH1COMADD) && ((int_flag) != TIMER_INT_FLAG_MCH2COMADD) && \
                                                               ((int_flag) != TIMER_INT_FLAG_MCH3COMADD) && ((int_flag) != TIMER_INT_FLAG_UP0) && \
                                                               ((int_flag) != TIMER_INT_FLAG_UP1)        && ((int_flag) != TIMER_INT_FLAG_UP2) && \
                                                               ((int_flag) != TIMER_INT_FLAG_UP3))

