sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* TIMER master and slave mode */
/* select TIMER input trigger source */
void timer_input_trigger_source_select(uint32_t timer_periph, uint32_t intrigger);
/* select TIMER master mode output trigger source */
void timer_master_output_trigger_source_select(uint32_t timer_periph, uint32_t outtrigger);
/* select TIMER slave mode */
void timer_slave_mode_select(uint32_t timer_periph, uint32_t slavemode);
/* configure TIMER master slave mode */
void timer_master_slave_mode_config(uint32_t timer_periph, uint32_t masterslave);
/* configure TIMER external trigger source */
void timer_external_trigger_select(uint32_t timer_periph, uint32_t ext_trg);
/* configure TIMER external trigger input */
void timer_external_trigger_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter);
/* configure TIMER quadrature decoder mode */
void timer_quadrature_decoder_mode_config(uint32_t timer_periph, uint32_t decomode, uint16_t ic0polarity, uint16_t ic1polarity);
/* quadrature decoder signal disconnection detection watchdog value config */
void timer_watchdog_value_config(uint32_t timer_periph, uint32_t counter);
/* read quadrature decoder signal disconnection detection watchdog value */
uint32_t timer_watchdog_value_read(uint32_t timer_periph);
/* configure quadrature decoder signal disconnection detection function */
void timer_decoder_disconnection_detection_config(uint32_t timer_periph, ControlStatus newvalue);
/* configure decoder signal jump detection function */
void timer_decoder_jump_detection_config(uint32_t timer_periph, ControlStatus newvalue);

/* configure TIMER internal clock mode */
void timer_internal_clock_config(uint32_t timer_periph);
/* configure TIMER the internal trigger as external clock input */
void timer_internal_trigger_as_external_clock_config(uint32_t timer_periph, uint32_t intrigger);
/* configure TIMER the external trigger as external clock input */
void timer_external_trigger_as_external_clock_config(uint32_t timer_periph, uint32_t extrigger, uint16_t extpolarity, uint32_t extfilter);
/* configure TIMER the external clock mode 0 */
void timer_external_clock_mode0_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter);
/* configure TIMER the external clock mode 1 */
void timer_external_clock_mode1_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter);
/* disable TIMER the external clock mode 1 */
void timer_external_clock_mode1_disable(uint32_t timer_periph);

/* TIMER configure */
/* configure TIMER channel input remap function */
void timer_channel_remap_config(uint32_t timer_periph, uint32_t remap);
/* configure TIMER write CHxVAL register selection */
void timer_write_chxval_register_config(uint32_t timer_periph, uint16_t ccsel);
/* configure TIMER output value selection */
void timer_output_value_selection_config(uint32_t timer_periph, uint16_t outsel);
/* configure TIMER commutation control shadow update config */
void timer_commutation_control_shadow_update_config(uint32_t timer_periph, uint16_t ccusel);
/* configure TIMER read selection */
void timer_read_selection_config(uint32_t timer_periph, uint16_t rdsel);
/* configure TIMER output match pulse selection */
void timer_output_match_pulse_select(uint32_t timer_periph, uint32_t channel, uint16_t pulsesel);

/* TIMER composite PWM mode */
/* configure the TIMER composite PWM mode output pulse value */
void timer_channel_composite_pwm_mode_output_pulse_value_config(uint32_t timer_periph, uint32_t channel, uint32_t pulse, uint32_t add_pulse);
/* configure TIMER channel additional compare value */
void timer_channel_additional_compare_value_config(uint32_t timer_periph, uint16_t channel, uint32_t value);
/* read TIMER channel additional compare value */
uint16_t timer_channel_additional_compare_value_read(uint32_t timer_periph, uint16_t channel);
/* configure TIMER channel additional output shadow function */
void timer_channel_additional_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t aocshadow);
/* select TIMER channel additional output shadow register update source */
void timer_channel_additional_output_update_select(uint32_t timer_periph, uint16_t channel, uint16_t update);
/* configure TIMER channel asymmetric PWM mode */
void timer_channel_asymmetric_pwm_mode_config(uint32_t timer_periph,uint32_t channel, timer_channel_asymmetric_pwm_mode_struct *asymmetric_pwm_para);

/* TIMER break external inputs */
/* initialize TIMER break external input parameter struct */
void timer_break_external_input_struct_para_init(timer_break_ext_input_struct *breakinpara);
/* configure TIMER break external input polarity */
void timer_break_external_input_config(uint32_t timer_periph, uint32_t break_input, timer_break_ext_input_struct *breakinpara);
/* break external input enable */
void timer_break_external_input_enable(uint32_t timer_periph, uint32_t break_input);
/* break external input disable */
void timer_break_external_input_disable(uint32_t timer_periph, uint32_t break_input);
/* configure TIMER break external input polarity */
void timer_break_external_input_polarity_config(uint32_t timer_periph, uint32_t break_input, uint32_t polarity);

/* TIMER channel free complementary protection */
/* configure the TIMER channel break function */
void timer_channel_break_control_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue);
/* configure the TIMER deat time shadow function */
void timer_dead_time_shadow_config(uint32_t timer_periph, ControlStatus newvalue);
/* configure the TIMER channel dead time function */
void timer_channel_dead_time_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue);
/* initialize TIMER channel free complementary parameter struct with a default value */
void timer_free_complementary_struct_para_init(timer_free_complementary_parameter_struct *freecompara);
/* configure channel free complementary protection */
void timer_channel_free_complementary_config(uint32_t timer_periph, uint16_t channel, timer_free_complementary_parameter_struct *fcpara);

/* TIMER counter initial function */
/* configure initial counter function */
void timer_initial_counter_config(uint32_t timer_periph, uint32_t value, uint32_t direction);
/* configure counter initial value register */
void timer_initial_counter_register_config(uint32_t timer_periph, ControlStatus newvalue);
/*  generate soft synchronization event */
void timer_synchronization_event_generate(uint32_t timer_periph);

