sorosaulong-ux/gd32-test-project/Library/gd32a7xx_timer.h
/* TIMER basic function */
/* initialize TIMER counter */
void timer_basic_init(uint32_t timer_periph, uint32_t timer_channel, timer_parameter_struct *initpara);
/* enable a TIMER */
void timer_basic_enable(uint32_t timer_periph, uint32_t timer_channel);
/* disable a TIMER */
void timer_basic_disable(uint32_t timer_periph, uint32_t timer_channel);
/* enable the auto reload shadow function */
void timer_basic_auto_reload_shadow_enable(uint32_t timer_periph, uint32_t timer_channel);
/* disable the auto reload shadow function */
void timer_basic_auto_reload_shadow_disable(uint32_t timer_periph, uint32_t timer_channel);
/* enable the update event */
void timer_basic_update_event_enable(uint32_t timer_periph, uint32_t timer_channel);
/* disable the update event */
void timer_basic_update_event_disable(uint32_t timer_periph, uint32_t timer_channel);
/* configure TIMER prescaler */
void timer_basic_prescaler_config(uint32_t timer_periph, uint32_t timer_channel, uint16_t prescaler, uint32_t pscreload);
/* configure TIMER autoreload register value */
void timer_basic_autoreload_value_config(uint32_t timer_periph, uint32_t timer_channel, uint32_t autoreload);
/* get TIMER autoreload register value */
uint32_t timer_basic_autoreload_value_read(uint32_t timer_periph, uint32_t timer_channel);
/* configure TIMER counter register value */
void timer_basic_counter_value_config(uint32_t timer_periph, uint32_t timer_channel, uint32_t counter);
/* read TIMER counter value */
uint32_t timer_basic_counter_read(uint32_t timer_periph, uint32_t timer_channel);
/* read TIMER prescaler value */
uint16_t timer_basic_prescaler_read(uint32_t timer_periph, uint32_t timer_channel);
/* configure TIMER single pulse mode */
void timer_basic_single_pulse_mode_config(uint32_t timer_periph, uint32_t timer_channel, uint32_t spmode);
/* configure TIMER update source */
void timer_basic_update_source_config(uint32_t timer_periph, uint32_t timer_channel, uint32_t update);
/* TIMER DMA and event */
/* enable the TIMER DMA */
void timer_basic_dma_enable(uint32_t timer_periph, uint32_t dma);
/* disable the TIMER DMA */
void timer_basic_dma_disable(uint32_t timer_periph, uint32_t dma);
/* software generate events */
void timer_basic_event_software_generate(uint32_t timer_periph, uint32_t event);
/* enable basic TIMER cascade mode */
void timer_basic_cascade_mode_enable(uint32_t timer_periph, uint32_t timer_channel);
/* disable basic TIMER cascade mode */
void timer_basic_cascade_mode_disable(uint32_t timer_periph, uint32_t timer_channel);
/* read basic TIMER cascade counter value */
uint64_t timer_basic_cascade_counter_read(uint32_t timer_periph);
/* select basic TIMER master mode output trigger source */
void timer_basic_master_output_trigger_source_select(uint32_t timer_periph, uint32_t timer_channel, uint32_t outtrigger);

/* TIMER interrupt and flag */
/* get TIMER flags */
FlagStatus timer_flag_get(uint32_t timer_periph, uint32_t flag);
/* clear TIMER flags */
void timer_flag_clear(uint32_t timer_periph, uint32_t flag);
/* enable the TIMER interrupt */
void timer_interrupt_enable(uint32_t timer_periph, timer_interrupt_enum interrupt);
/* disable the TIMER interrupt */
void timer_interrupt_disable(uint32_t timer_periph, timer_interrupt_enum interrupt);
/* get TIMER interrupt flags */
FlagStatus timer_interrupt_flag_get(uint32_t timer_periph, uint32_t int_flag);
/* clear TIMER interrupt flags */
void timer_interrupt_flag_clear(uint32_t timer_periph, uint32_t int_flag);


#endif /* GD32A7XX_TIMER_H */
